/* automatically generated by rust-bindgen 0.56.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align> {
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]

pub const ITEM_RAYGUNUNK: u32 = 35;
pub const ITEM_STARRODSTAR: u32 = 36;
pub const ITEM_LIPSSTICKDUST: u32 = 37;
pub const ITEM_SUPERSCOPEBEAM: u32 = 38;
pub const ITEM_RAYGUNBEAM: u32 = 39;
pub const ITEM_HAMMERHEAD: u32 = 40;
pub const ITEM_FLOWER: u32 = 41;
pub const ITEM_YOSHISEGG: u32 = 42;
pub const ITEM_GOOMBA: u32 = 43;
pub const ITEM_REDEAD: u32 = 44;
pub const ITEM_OCTAROK: u32 = 45;
pub const ITEM_OTTOSEA: u32 = 46;
pub const ITEM_STONE: u32 = 47;
pub const ITEM_MARIOFIRE: u32 = 48;
pub const ITEM_DRMARIOPILL: u32 = 49;
pub const ITEM_KIRBYCUTTER: u32 = 50;
pub const ITEM_KIRBYHAMMER: u32 = 51;
pub const ITEM_KIRBYABILITYSTAR: u32 = 52;
pub const ITEM_POKERANDOM: u32 = 160;
pub const ITEM_GOLDEEN: u32 = 161;
pub const ITEM_CHICORITA: u32 = 162;
pub const ITEM_SNORLAX: u32 = 163;
pub const ITEM_BLASTOISE: u32 = 164;
pub const ITEM_WEEZING: u32 = 165;
pub const ITEM_CHARIZARD: u32 = 166;
pub const ITEM_MOLTRES: u32 = 167;
pub const ITEM_ZAPDOS: u32 = 168;
pub const ITEM_ARCTICUNO: u32 = 169;
pub const ITEM_WOBBUFFET: u32 = 170;
pub const ITEM_SCIZOR: u32 = 171;
pub const ITEM_UNOWN: u32 = 172;
pub const ITEM_ENTEI: u32 = 173;
pub const ITEM_RAIKOU: u32 = 174;
pub const ITEM_SUICUNE: u32 = 175;
pub const ITEM_BELLOSSOM: u32 = 176;
pub const ITEM_ELECTRODE: u32 = 177;
pub const ITEM_LUGIA: u32 = 178;
pub const ITEM_HOOH: u32 = 179;
pub const ITEM_DITTO: u32 = 180;
pub const ITEM_CLEFAIRY: u32 = 181;
pub const ITEM_TOGEPI: u32 = 182;
pub const ITEM_MEW: u32 = 183;
pub const ITEM_CELEBI: u32 = 184;
pub const ITEM_STARYU: u32 = 185;
pub const ITEM_CHANSEY: u32 = 186;
pub const ITEM_PORYGON2: u32 = 187;
pub const ITEM_CYNDAQUIL: u32 = 188;
pub const ITEM_MARILL: u32 = 189;
pub const ITEM_VENUSAUR: u32 = 190;
pub const ITEM_TARGET: u32 = 209;
pub const ITEMSTATE_UPDATEANIM: u32 = 2;
pub const ITEMSTATE_GRAB: u32 = 4;
pub const ITEMSTATE_KEEPHIT: u32 = 16;
pub const ITHOLD_HAND: u32 = 0;
pub const ITHOLD_HEAVY: u32 = 1;
pub const ITHOLD_NONE: u32 = 8;
pub const MEMCARD_BANNER_SIZE: u32 = 6144;
pub const MEMCARD_ICON_SIZE: u32 = 1024;
pub const map_isBG: u32 = 1073741824;
pub const map_isUnk: u32 = 2147483648;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FtSymbolLookup {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FtSymbols {
    _unused: [u8; 0],
}
pub type s8 = ::std::os::raw::c_schar;
pub type s16 = ::std::os::raw::c_short;
pub type s32 = ::std::os::raw::c_int;
pub type s64 = ::std::os::raw::c_longlong;
pub type u8_ = ::std::os::raw::c_uchar;
pub type u16_ = ::std::os::raw::c_ushort;
pub type u32_ = ::std::os::raw::c_uint;
pub type u64_ = ::std::os::raw::c_ulonglong;
pub type f32_ = f32;
pub type f64_ = f64;
pub type Mtx = [[f32; 4usize]; 3usize];
pub type MtxPtr = *mut [f32; 4usize];
#[doc = " Structs"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Vec2 {
    pub X: f32,
    pub Y: f32,
}
#[test]
fn bindgen_test_layout_Vec2() {
    assert_eq!(
        ::std::mem::size_of::<Vec2>(),
        8usize,
        concat!("Size of: ", stringify!(Vec2))
    );
    assert_eq!(
        ::std::mem::align_of::<Vec2>(),
        4usize,
        concat!("Alignment of ", stringify!(Vec2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Vec2>())).X as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Vec2), "::", stringify!(X))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Vec2>())).Y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(Vec2), "::", stringify!(Y))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Vec3 {
    pub X: f32,
    pub Y: f32,
    pub Z: f32,
}
#[test]
fn bindgen_test_layout_Vec3() {
    assert_eq!(
        ::std::mem::size_of::<Vec3>(),
        12usize,
        concat!("Size of: ", stringify!(Vec3))
    );
    assert_eq!(
        ::std::mem::align_of::<Vec3>(),
        4usize,
        concat!("Alignment of ", stringify!(Vec3))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Vec3>())).X as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Vec3), "::", stringify!(X))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Vec3>())).Y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(Vec3), "::", stringify!(Y))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Vec3>())).Z as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(Vec3), "::", stringify!(Z))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Vec4 {
    pub X: f32,
    pub Y: f32,
    pub Z: f32,
    pub W: f32,
}
#[test]
fn bindgen_test_layout_Vec4() {
    assert_eq!(
        ::std::mem::size_of::<Vec4>(),
        16usize,
        concat!("Size of: ", stringify!(Vec4))
    );
    assert_eq!(
        ::std::mem::align_of::<Vec4>(),
        4usize,
        concat!("Alignment of ", stringify!(Vec4))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Vec4>())).X as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(Vec4), "::", stringify!(X))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Vec4>())).Y as *const _ as usize },
        4usize,
        concat!("Offset of field: ", stringify!(Vec4), "::", stringify!(Y))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Vec4>())).Z as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(Vec4), "::", stringify!(Z))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Vec4>())).W as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(Vec4), "::", stringify!(W))
    );
}
extern "C" {
    pub fn Nametag_GetText(tag_index: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Audio_ResetCache(group_index: ::std::os::raw::c_int);
}
extern "C" {
    pub fn Audio_QueueFileLoad(group_index: ::std::os::raw::c_int, ssm_index: u64_);
}
extern "C" {
    pub fn Audio_UpdateCache();
}
extern "C" {
    pub fn Audio_SyncLoadAll();
}
extern "C" {
    pub fn BGM_GetMenuBGM() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn BGM_Play(hpsID: ::std::os::raw::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ArchiveInfo {
    pub file_size: ::std::os::raw::c_int,
    pub reloc_offset: *mut ::std::os::raw::c_int,
    pub reloc_num: ::std::os::raw::c_int,
    pub symbol_num: ::std::os::raw::c_int,
    pub refsymbol_num: ::std::os::raw::c_int,
    pub archive_vers: ::std::os::raw::c_int,
    pub unk1: ::std::os::raw::c_int,
    pub unk2: ::std::os::raw::c_int,
    pub general_points: *mut ::std::os::raw::c_int,
    pub reloc_table: *mut ::std::os::raw::c_int,
    pub symbols1: *mut ::std::os::raw::c_int,
    pub refsymmbols: *mut ::std::os::raw::c_int,
    pub symbols2: *mut ::std::os::raw::c_int,
    pub file_start: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ArchiveInfo() {
    assert_eq!(
        ::std::mem::size_of::<ArchiveInfo>(),
        88usize,
        concat!("Size of: ", stringify!(ArchiveInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<ArchiveInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(ArchiveInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).file_size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(file_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).reloc_offset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(reloc_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).reloc_num as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(reloc_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).symbol_num as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(symbol_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).refsymbol_num as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(refsymbol_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).archive_vers as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(archive_vers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).unk1 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(unk1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).unk2 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(unk2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).general_points as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(general_points)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).reloc_table as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(reloc_table)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).symbols1 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(symbols1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).refsymmbols as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(refsymmbols)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).symbols2 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(symbols2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ArchiveInfo>())).file_start as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ArchiveInfo),
            "::",
            stringify!(file_start)
        )
    );
}
extern "C" {
    pub fn File_Load(filename: *mut ::std::os::raw::c_char) -> *mut ArchiveInfo;
}
extern "C" {
    pub fn File_LoadInitReturnSymbol(
        filename: *mut ::std::os::raw::c_char,
        ptr: *mut ::std::os::raw::c_void,
        ...
    );
}
extern "C" {
    pub fn File_GetSymbol(
        archive: *mut ::std::os::raw::c_void,
        symbol: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_void;
}
#[doc = " Structs"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GXColor {
    pub r: u8_,
    pub g: u8_,
    pub b: u8_,
    pub a: u8_,
}
#[test]
fn bindgen_test_layout_GXColor() {
    assert_eq!(
        ::std::mem::size_of::<GXColor>(),
        4usize,
        concat!("Size of: ", stringify!(GXColor))
    );
    assert_eq!(
        ::std::mem::align_of::<GXColor>(),
        1usize,
        concat!("Alignment of ", stringify!(GXColor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GXColor>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GXColor),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GXColor>())).g as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(GXColor),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GXColor>())).b as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(GXColor),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GXColor>())).a as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(GXColor),
            "::",
            stringify!(a)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ColorOverlay {
    pub timer: ::std::os::raw::c_int,
    pub pri: ::std::os::raw::c_int,
    pub ptr1: *mut ::std::os::raw::c_int,
    pub loop_: ::std::os::raw::c_int,
    pub ptr2: *mut ::std::os::raw::c_int,
    pub x14: ::std::os::raw::c_int,
    pub alloc: *mut ::std::os::raw::c_int,
    pub x1c: ::std::os::raw::c_int,
    pub x20: ::std::os::raw::c_int,
    pub x24: ::std::os::raw::c_int,
    pub colanim: ::std::os::raw::c_int,
    pub hex: GXColor,
    pub color_red: f32,
    pub color_green: f32,
    pub color_blue: f32,
    pub color_alpha: f32,
    pub colorblend_red: f32,
    pub colorblend_green: f32,
    pub colorblend_blue: f32,
    pub colorblend_alpha: f32,
    pub light_color: GXColor,
    pub light_red: f32,
    pub light_green: f32,
    pub light_blue: f32,
    pub light_alpha: f32,
    pub lightblend_red: f32,
    pub lightblend_green: f32,
    pub lightblend_blue: f32,
    pub lightblend_alpha: f32,
    pub light_angle: f32,
    pub light_unk: f32,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub __bindgen_padding_0: [u8; 7usize],
}
#[test]
fn bindgen_test_layout_ColorOverlay() {
    assert_eq!(
        ::std::mem::size_of::<ColorOverlay>(),
        152usize,
        concat!("Size of: ", stringify!(ColorOverlay))
    );
    assert_eq!(
        ::std::mem::align_of::<ColorOverlay>(),
        8usize,
        concat!("Alignment of ", stringify!(ColorOverlay))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).timer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(timer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).pri as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(pri)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).ptr1 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(ptr1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).loop_ as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(loop_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).ptr2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(ptr2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).x14 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(x14)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).alloc as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).x1c as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(x1c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).x20 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(x20)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).x24 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(x24)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).colanim as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(colanim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).hex as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(hex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).color_red as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(color_red)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).color_green as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(color_green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).color_blue as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(color_blue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).color_alpha as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(color_alpha)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).colorblend_red as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(colorblend_red)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).colorblend_green as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(colorblend_green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).colorblend_blue as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(colorblend_blue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).colorblend_alpha as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(colorblend_alpha)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).light_color as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(light_color)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).light_red as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(light_red)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).light_green as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(light_green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).light_blue as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(light_blue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).light_alpha as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(light_alpha)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).lightblend_red as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(lightblend_red)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).lightblend_green as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(lightblend_green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).lightblend_blue as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(lightblend_blue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).lightblend_alpha as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(lightblend_alpha)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).light_angle as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(light_angle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ColorOverlay>())).light_unk as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(ColorOverlay),
            "::",
            stringify!(light_unk)
        )
    );
}
impl ColorOverlay {
    #[inline]
    pub fn color_enable(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_color_enable(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn flag2(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_flag2(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn light_enable(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_light_enable(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn flag4(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_flag4(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn flag5(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_flag5(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn flag6(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_flag6(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn flag7(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_flag7(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn flag8(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_flag8(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        color_enable: ::std::os::raw::c_uchar,
        flag2: ::std::os::raw::c_uchar,
        light_enable: ::std::os::raw::c_uchar,
        flag4: ::std::os::raw::c_uchar,
        flag5: ::std::os::raw::c_uchar,
        flag6: ::std::os::raw::c_uchar,
        flag7: ::std::os::raw::c_uchar,
        flag8: ::std::os::raw::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let color_enable: u8 = unsafe { ::std::mem::transmute(color_enable) };
            color_enable as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let flag2: u8 = unsafe { ::std::mem::transmute(flag2) };
            flag2 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let light_enable: u8 = unsafe { ::std::mem::transmute(light_enable) };
            light_enable as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let flag4: u8 = unsafe { ::std::mem::transmute(flag4) };
            flag4 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let flag5: u8 = unsafe { ::std::mem::transmute(flag5) };
            flag5 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let flag6: u8 = unsafe { ::std::mem::transmute(flag6) };
            flag6 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let flag7: u8 = unsafe { ::std::mem::transmute(flag7) };
            flag7 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let flag8: u8 = unsafe { ::std::mem::transmute(flag8) };
            flag8 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = " Structs"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GOBJ {
    pub entity_class: ::std::os::raw::c_short,
    pub p_link: ::std::os::raw::c_char,
    pub gx_link: ::std::os::raw::c_char,
    pub p_priority: ::std::os::raw::c_char,
    pub gx_pri: ::std::os::raw::c_char,
    pub obj_kind: ::std::os::raw::c_char,
    pub data_kind: ::std::os::raw::c_char,
    pub next: *mut GOBJ,
    pub previous: *mut GOBJ,
    pub nextOrdered: *mut GOBJ,
    pub previousOrdered: *mut GOBJ,
    pub proc_: *mut GOBJProc,
    pub gx_cb: *mut ::std::os::raw::c_void,
    pub cobj_links: u64_,
    pub hsd_object: *mut ::std::os::raw::c_void,
    pub userdata: *mut ::std::os::raw::c_void,
    pub destructor_function: ::std::os::raw::c_int,
    pub unk_linked_list: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_GOBJ() {
    assert_eq!(
        ::std::mem::size_of::<GOBJ>(),
        88usize,
        concat!("Size of: ", stringify!(GOBJ))
    );
    assert_eq!(
        ::std::mem::align_of::<GOBJ>(),
        8usize,
        concat!("Alignment of ", stringify!(GOBJ))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).entity_class as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(entity_class)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).p_link as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(p_link)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).gx_link as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(gx_link)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).p_priority as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(p_priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).gx_pri as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(gx_pri)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).obj_kind as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(obj_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).data_kind as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(data_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).previous as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(previous)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).nextOrdered as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(nextOrdered)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).previousOrdered as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(previousOrdered)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).proc_ as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(proc_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).gx_cb as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(gx_cb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).cobj_links as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(cobj_links)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).hsd_object as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(hsd_object)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).userdata as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(userdata)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).destructor_function as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(destructor_function)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJ>())).unk_linked_list as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJ),
            "::",
            stringify!(unk_linked_list)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GOBJProc {
    pub parent: *mut GOBJ,
    pub next: *mut GOBJProc,
    pub prev: *mut GOBJProc,
    pub s_link: ::std::os::raw::c_char,
    pub flags: ::std::os::raw::c_char,
    pub parentGOBJ: *mut GOBJ,
    pub cb: ::std::option::Option<unsafe extern "C" fn(gobj: *mut GOBJ)>,
}
#[test]
fn bindgen_test_layout_GOBJProc() {
    assert_eq!(
        ::std::mem::size_of::<GOBJProc>(),
        48usize,
        concat!("Size of: ", stringify!(GOBJProc))
    );
    assert_eq!(
        ::std::mem::align_of::<GOBJProc>(),
        8usize,
        concat!("Alignment of ", stringify!(GOBJProc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJProc>())).parent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJProc),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJProc>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJProc),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJProc>())).prev as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJProc),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJProc>())).s_link as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJProc),
            "::",
            stringify!(s_link)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJProc>())).flags as *const _ as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJProc),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJProc>())).parentGOBJ as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJProc),
            "::",
            stringify!(parentGOBJ)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJProc>())).cb as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJProc),
            "::",
            stringify!(cb)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GOBJList {
    pub x0: *mut GOBJ,
    pub x4: *mut GOBJ,
    pub x8: *mut GOBJ,
    pub xc: *mut GOBJ,
    pub x10: *mut GOBJ,
    pub cobj: *mut GOBJ,
    pub x18: *mut GOBJ,
    pub x1c: *mut GOBJ,
    pub fighter: *mut GOBJ,
    pub item: *mut GOBJ,
    pub x28: *mut GOBJ,
    pub effect_model: *mut GOBJ,
    pub effect_unk: *mut GOBJ,
    pub x34: *mut GOBJ,
    pub x38: *mut GOBJ,
    pub x3c: *mut GOBJ,
    pub x40: *mut GOBJ,
    pub x44: *mut GOBJ,
    pub match_cam: *mut GOBJ,
}
#[test]
fn bindgen_test_layout_GOBJList() {
    assert_eq!(
        ::std::mem::size_of::<GOBJList>(),
        152usize,
        concat!("Size of: ", stringify!(GOBJList))
    );
    assert_eq!(
        ::std::mem::align_of::<GOBJList>(),
        8usize,
        concat!("Alignment of ", stringify!(GOBJList))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x4 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x8 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).xc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(xc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x10 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x10)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).cobj as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(cobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x18 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x18)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x1c as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x1c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).fighter as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(fighter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).item as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(item)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x28 as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x28)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).effect_model as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(effect_model)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).effect_unk as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(effect_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x34 as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x34)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x38 as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x38)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x3c as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x3c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x40 as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x40)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).x44 as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(x44)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GOBJList>())).match_cam as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(GOBJList),
            "::",
            stringify!(match_cam)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct GXList {
    pub gx_render: [*mut GOBJ; 63usize],
    pub gx_camera: *mut GOBJ,
}
#[test]
fn bindgen_test_layout_GXList() {
    assert_eq!(
        ::std::mem::size_of::<GXList>(),
        512usize,
        concat!("Size of: ", stringify!(GXList))
    );
    assert_eq!(
        ::std::mem::align_of::<GXList>(),
        8usize,
        concat!("Alignment of ", stringify!(GXList))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GXList>())).gx_render as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GXList),
            "::",
            stringify!(gx_render)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GXList>())).gx_camera as *const _ as usize },
        504usize,
        concat!(
            "Offset of field: ",
            stringify!(GXList),
            "::",
            stringify!(gx_camera)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TOBJ {
    pub parent: *mut ::std::os::raw::c_int,
    pub x4: ::std::os::raw::c_int,
    pub next: *mut TOBJ,
    pub id: u32_,
    pub src: u32_,
    pub mtxid: u32_,
    pub rotate: Vec4,
    pub scale: Vec3,
    pub translate: Vec3,
    pub wrap_s: u32_,
    pub wrap_t: u32_,
    pub repeat_s: u8_,
    pub repeat_t: u8_,
    pub anim_id: u16_,
    pub flags: u32_,
    pub blending: f32_,
    pub magFilt: u32_,
    pub imagedesc: *mut _HSD_ImageDesc,
    pub tlut: *mut _HSD_Tlut,
    pub lod: *mut _HSD_TexLODDesc,
    pub aobj: *mut AOBJ,
    pub imagetbl: *mut *mut _HSD_ImageDesc,
    pub tluttbl: *mut *mut _HSD_Tlut,
    pub tlut_no: u8_,
    pub mtx: Mtx,
    pub coord: u32_,
    pub tev: *mut _HSD_TObjTev,
}
#[test]
fn bindgen_test_layout_TOBJ() {
    assert_eq!(
        ::std::mem::size_of::<TOBJ>(),
        216usize,
        concat!("Size of: ", stringify!(TOBJ))
    );
    assert_eq!(
        ::std::mem::align_of::<TOBJ>(),
        8usize,
        concat!("Alignment of ", stringify!(TOBJ))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).parent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).x4 as *const _ as usize },
        8usize,
        concat!("Offset of field: ", stringify!(TOBJ), "::", stringify!(x4))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).id as *const _ as usize },
        24usize,
        concat!("Offset of field: ", stringify!(TOBJ), "::", stringify!(id))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).src as *const _ as usize },
        28usize,
        concat!("Offset of field: ", stringify!(TOBJ), "::", stringify!(src))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).mtxid as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(mtxid)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).rotate as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(rotate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).scale as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).translate as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(translate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).wrap_s as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(wrap_s)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).wrap_t as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(wrap_t)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).repeat_s as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(repeat_s)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).repeat_t as *const _ as usize },
        85usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(repeat_t)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).anim_id as *const _ as usize },
        86usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(anim_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).flags as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).blending as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(blending)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).magFilt as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(magFilt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).imagedesc as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(imagedesc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).tlut as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(tlut)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).lod as *const _ as usize },
        120usize,
        concat!("Offset of field: ", stringify!(TOBJ), "::", stringify!(lod))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).aobj as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(aobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).imagetbl as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(imagetbl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).tluttbl as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(tluttbl)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).tlut_no as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(tlut_no)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).mtx as *const _ as usize },
        156usize,
        concat!("Offset of field: ", stringify!(TOBJ), "::", stringify!(mtx))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).coord as *const _ as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(TOBJ),
            "::",
            stringify!(coord)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<TOBJ>())).tev as *const _ as usize },
        208usize,
        concat!("Offset of field: ", stringify!(TOBJ), "::", stringify!(tev))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AOBJ {
    pub flags: u32_,
    pub curr_frame: f32_,
    pub rewind_frame: f32_,
    pub end_frame: f32_,
    pub framerate: f32_,
    pub fobj: *mut _HSD_FObj,
    pub hsd_obj: *mut _HSD_Obj,
}
#[test]
fn bindgen_test_layout_AOBJ() {
    assert_eq!(
        ::std::mem::size_of::<AOBJ>(),
        40usize,
        concat!("Size of: ", stringify!(AOBJ))
    );
    assert_eq!(
        ::std::mem::align_of::<AOBJ>(),
        8usize,
        concat!("Alignment of ", stringify!(AOBJ))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AOBJ>())).flags as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AOBJ),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AOBJ>())).curr_frame as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AOBJ),
            "::",
            stringify!(curr_frame)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AOBJ>())).rewind_frame as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AOBJ),
            "::",
            stringify!(rewind_frame)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AOBJ>())).end_frame as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(AOBJ),
            "::",
            stringify!(end_frame)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AOBJ>())).framerate as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(AOBJ),
            "::",
            stringify!(framerate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AOBJ>())).fobj as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AOBJ),
            "::",
            stringify!(fobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AOBJ>())).hsd_obj as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AOBJ),
            "::",
            stringify!(hsd_obj)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MOBJ {
    pub parent: *mut ::std::os::raw::c_int,
    pub rendermode: u32_,
    pub tobj: *mut TOBJ,
    pub mat: *mut HSD_Material,
    pub pe: *mut _HSD_PEDesc,
    pub aobj: *mut AOBJ,
    pub tevdesc: *mut _HSD_TExpTevDesc,
    pub tobj_toon: *mut _HSD_TObj,
    pub tobj_gradation: *mut _HSD_TObj,
    pub tobj_backlight: *mut _HSD_TObj,
    pub z_offset: f32_,
}
#[test]
fn bindgen_test_layout_MOBJ() {
    assert_eq!(
        ::std::mem::size_of::<MOBJ>(),
        88usize,
        concat!("Size of: ", stringify!(MOBJ))
    );
    assert_eq!(
        ::std::mem::align_of::<MOBJ>(),
        8usize,
        concat!("Alignment of ", stringify!(MOBJ))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MOBJ>())).parent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MOBJ),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MOBJ>())).rendermode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MOBJ),
            "::",
            stringify!(rendermode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MOBJ>())).tobj as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MOBJ),
            "::",
            stringify!(tobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MOBJ>())).mat as *const _ as usize },
        24usize,
        concat!("Offset of field: ", stringify!(MOBJ), "::", stringify!(mat))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MOBJ>())).pe as *const _ as usize },
        32usize,
        concat!("Offset of field: ", stringify!(MOBJ), "::", stringify!(pe))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MOBJ>())).aobj as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MOBJ),
            "::",
            stringify!(aobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MOBJ>())).tevdesc as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MOBJ),
            "::",
            stringify!(tevdesc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MOBJ>())).tobj_toon as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(MOBJ),
            "::",
            stringify!(tobj_toon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MOBJ>())).tobj_gradation as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(MOBJ),
            "::",
            stringify!(tobj_gradation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MOBJ>())).tobj_backlight as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(MOBJ),
            "::",
            stringify!(tobj_backlight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MOBJ>())).z_offset as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(MOBJ),
            "::",
            stringify!(z_offset)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct JOBJDesc {
    pub class_name: *mut ::std::os::raw::c_char,
    pub flags: u32_,
    pub child: *mut JOBJDesc,
    pub next: *mut JOBJDesc,
    pub u: JOBJDesc__bindgen_ty_1,
    pub rotation: Vec3,
    pub scale: Vec3,
    pub position: Vec3,
    pub mtx: Mtx,
    pub robjdesc: *mut _HSD_RObjDesc,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union JOBJDesc__bindgen_ty_1 {
    pub dobjdesc: *mut _HSD_DObjDesc,
    pub spline: *mut _HSD_Spline,
    pub ptcl: *mut _HSD_SList,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_JOBJDesc__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<JOBJDesc__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(JOBJDesc__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<JOBJDesc__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(JOBJDesc__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc__bindgen_ty_1>())).dobjdesc as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc__bindgen_ty_1),
            "::",
            stringify!(dobjdesc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc__bindgen_ty_1>())).spline as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc__bindgen_ty_1),
            "::",
            stringify!(spline)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc__bindgen_ty_1>())).ptcl as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc__bindgen_ty_1),
            "::",
            stringify!(ptcl)
        )
    );
}
#[test]
fn bindgen_test_layout_JOBJDesc() {
    assert_eq!(
        ::std::mem::size_of::<JOBJDesc>(),
        136usize,
        concat!("Size of: ", stringify!(JOBJDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<JOBJDesc>(),
        8usize,
        concat!("Alignment of ", stringify!(JOBJDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc>())).class_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc),
            "::",
            stringify!(class_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc>())).child as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc),
            "::",
            stringify!(child)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc>())).next as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc>())).u as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc>())).rotation as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc),
            "::",
            stringify!(rotation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc>())).scale as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc>())).position as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc>())).mtx as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc),
            "::",
            stringify!(mtx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJDesc>())).robjdesc as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJDesc),
            "::",
            stringify!(robjdesc)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct COBJDesc {
    pub class_name: *mut ::std::os::raw::c_char,
    pub flags: u16_,
    pub projection_type: u16_,
    pub viewport_left: u16_,
    pub viewport_right: u16_,
    pub viewport_top: u16_,
    pub viewport_bottom: u16_,
    pub scissor_lr: u32_,
    pub scissor_tb: u32_,
    pub eye_desc: *mut _HSD_WObjDesc,
    pub interest_desc: *mut _HSD_WObjDesc,
    pub roll: f32_,
    pub vector: *mut Vec3,
    pub near: f32_,
    pub far: f32_,
    pub projection_param: COBJDesc__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union COBJDesc__bindgen_ty_1 {
    pub perspective: COBJDesc__bindgen_ty_1__bindgen_ty_1,
    pub frustrum: COBJDesc__bindgen_ty_1__bindgen_ty_2,
    pub ortho: COBJDesc__bindgen_ty_1__bindgen_ty_3,
    _bindgen_union_align: [u32; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct COBJDesc__bindgen_ty_1__bindgen_ty_1 {
    pub fov: f32_,
    pub aspect: f32_,
}
#[test]
fn bindgen_test_layout_COBJDesc__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<COBJDesc__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<COBJDesc__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1__bindgen_ty_1>())).fov as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(fov)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1__bindgen_ty_1>())).aspect as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(aspect)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct COBJDesc__bindgen_ty_1__bindgen_ty_2 {
    pub top: f32_,
    pub bottom: f32_,
    pub left: f32_,
    pub right: f32_,
}
#[test]
fn bindgen_test_layout_COBJDesc__bindgen_ty_1__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<COBJDesc__bindgen_ty_1__bindgen_ty_2>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<COBJDesc__bindgen_ty_1__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1__bindgen_ty_2>())).top as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1__bindgen_ty_2>())).bottom as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1__bindgen_ty_2>())).left as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1__bindgen_ty_2>())).right as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_2),
            "::",
            stringify!(right)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct COBJDesc__bindgen_ty_1__bindgen_ty_3 {
    pub top: f32_,
    pub bottom: f32_,
    pub left: f32_,
    pub right: f32_,
}
#[test]
fn bindgen_test_layout_COBJDesc__bindgen_ty_1__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<COBJDesc__bindgen_ty_1__bindgen_ty_3>(),
        16usize,
        concat!(
            "Size of: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<COBJDesc__bindgen_ty_1__bindgen_ty_3>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1__bindgen_ty_3>())).top as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1__bindgen_ty_3>())).bottom as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1__bindgen_ty_3>())).left as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1__bindgen_ty_3>())).right as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1__bindgen_ty_3),
            "::",
            stringify!(right)
        )
    );
}
#[test]
fn bindgen_test_layout_COBJDesc__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<COBJDesc__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(COBJDesc__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<COBJDesc__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(COBJDesc__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1>())).perspective as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1),
            "::",
            stringify!(perspective)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1>())).frustrum as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1),
            "::",
            stringify!(frustrum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc__bindgen_ty_1>())).ortho as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc__bindgen_ty_1),
            "::",
            stringify!(ortho)
        )
    );
}
#[test]
fn bindgen_test_layout_COBJDesc() {
    assert_eq!(
        ::std::mem::size_of::<COBJDesc>(),
        88usize,
        concat!("Size of: ", stringify!(COBJDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<COBJDesc>(),
        8usize,
        concat!("Alignment of ", stringify!(COBJDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).class_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(class_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).projection_type as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(projection_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).viewport_left as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(viewport_left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).viewport_right as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(viewport_right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).viewport_top as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(viewport_top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).viewport_bottom as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(viewport_bottom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).scissor_lr as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(scissor_lr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).scissor_tb as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(scissor_tb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).eye_desc as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(eye_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).interest_desc as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(interest_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).roll as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(roll)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).vector as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(vector)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).near as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(near)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).far as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(far)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJDesc>())).projection_param as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJDesc),
            "::",
            stringify!(projection_param)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DOBJ {
    pub parent: ::std::os::raw::c_int,
    pub next: *mut DOBJ,
    pub mobj: *mut MOBJ,
    pub pobj: *mut ::std::os::raw::c_int,
    pub aobj: *mut AOBJ,
    pub flags: u32_,
    pub unk: u32_,
}
#[test]
fn bindgen_test_layout_DOBJ() {
    assert_eq!(
        ::std::mem::size_of::<DOBJ>(),
        48usize,
        concat!("Size of: ", stringify!(DOBJ))
    );
    assert_eq!(
        ::std::mem::align_of::<DOBJ>(),
        8usize,
        concat!("Alignment of ", stringify!(DOBJ))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DOBJ>())).parent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DOBJ),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DOBJ>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DOBJ),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DOBJ>())).mobj as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DOBJ),
            "::",
            stringify!(mobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DOBJ>())).pobj as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DOBJ),
            "::",
            stringify!(pobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DOBJ>())).aobj as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DOBJ),
            "::",
            stringify!(aobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DOBJ>())).flags as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(DOBJ),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DOBJ>())).unk as *const _ as usize },
        44usize,
        concat!("Offset of field: ", stringify!(DOBJ), "::", stringify!(unk))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JOBJ {
    pub hsd_info: ::std::os::raw::c_int,
    pub class_parent: ::std::os::raw::c_int,
    pub sibling: *mut JOBJ,
    pub parent: *mut JOBJ,
    pub child: *mut JOBJ,
    pub flags: ::std::os::raw::c_int,
    pub dobj: *mut DOBJ,
    pub rot: Vec4,
    pub scale: Vec3,
    pub trans: Vec3,
    pub rotMtx: Mtx,
    pub VEC: *mut Vec3,
    pub MTX: *mut Mtx,
    pub aobj: *mut AOBJ,
    pub RObj: *mut ::std::os::raw::c_int,
    pub desc: *mut JOBJDesc,
}
#[test]
fn bindgen_test_layout_JOBJ() {
    assert_eq!(
        ::std::mem::size_of::<JOBJ>(),
        176usize,
        concat!("Size of: ", stringify!(JOBJ))
    );
    assert_eq!(
        ::std::mem::align_of::<JOBJ>(),
        8usize,
        concat!("Alignment of ", stringify!(JOBJ))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).hsd_info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(hsd_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).class_parent as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(class_parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).sibling as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(sibling)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).parent as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).child as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(child)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).flags as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).dobj as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(dobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).rot as *const _ as usize },
        48usize,
        concat!("Offset of field: ", stringify!(JOBJ), "::", stringify!(rot))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).scale as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).trans as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(trans)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).rotMtx as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(rotMtx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).VEC as *const _ as usize },
        136usize,
        concat!("Offset of field: ", stringify!(JOBJ), "::", stringify!(VEC))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).MTX as *const _ as usize },
        144usize,
        concat!("Offset of field: ", stringify!(JOBJ), "::", stringify!(MTX))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).aobj as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(aobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).RObj as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(RObj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJ>())).desc as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJ),
            "::",
            stringify!(desc)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WOBJ {
    pub parent: *mut ::std::os::raw::c_void,
    pub flags: u32_,
    pub pos: Vec3,
    pub aobj: *mut AOBJ,
    pub robj: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_WOBJ() {
    assert_eq!(
        ::std::mem::size_of::<WOBJ>(),
        40usize,
        concat!("Size of: ", stringify!(WOBJ))
    );
    assert_eq!(
        ::std::mem::align_of::<WOBJ>(),
        8usize,
        concat!("Alignment of ", stringify!(WOBJ))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WOBJ>())).parent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WOBJ),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WOBJ>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WOBJ),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WOBJ>())).pos as *const _ as usize },
        12usize,
        concat!("Offset of field: ", stringify!(WOBJ), "::", stringify!(pos))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WOBJ>())).aobj as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WOBJ),
            "::",
            stringify!(aobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<WOBJ>())).robj as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WOBJ),
            "::",
            stringify!(robj)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct COBJ {
    pub parent: u64_,
    pub flags: u32_,
    pub viewport_left: f32_,
    pub viewport_right: f32_,
    pub viewport_top: f32_,
    pub viewport_bottom: f32_,
    pub scissor_left: u16_,
    pub scissor_right: u16_,
    pub scissor_top: u16_,
    pub scissor_bottom: u16_,
    pub eye_position: *mut WOBJ,
    pub interest: *mut WOBJ,
    pub u: COBJ__bindgen_ty_1,
    pub near: f32_,
    pub far: f32_,
    pub projection_param: COBJ__bindgen_ty_2,
    pub projection_type: u8_,
    pub view_mtx: Mtx,
    pub aobj: *mut AOBJ,
    pub proj_mtx: Mtx,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union COBJ__bindgen_ty_1 {
    pub roll: f32_,
    pub up: Vec3,
    _bindgen_union_align: [u32; 3usize],
}
#[test]
fn bindgen_test_layout_COBJ__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<COBJ__bindgen_ty_1>(),
        12usize,
        concat!("Size of: ", stringify!(COBJ__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<COBJ__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(COBJ__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ__bindgen_ty_1>())).roll as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_1),
            "::",
            stringify!(roll)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ__bindgen_ty_1>())).up as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_1),
            "::",
            stringify!(up)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union COBJ__bindgen_ty_2 {
    pub perspective: COBJ__bindgen_ty_2__bindgen_ty_1,
    pub frustrum: COBJ__bindgen_ty_2__bindgen_ty_2,
    pub ortho: COBJ__bindgen_ty_2__bindgen_ty_3,
    _bindgen_union_align: [u32; 4usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct COBJ__bindgen_ty_2__bindgen_ty_1 {
    pub fov: f32_,
    pub aspect: f32_,
}
#[test]
fn bindgen_test_layout_COBJ__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<COBJ__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(COBJ__bindgen_ty_2__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<COBJ__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJ__bindgen_ty_2__bindgen_ty_1>())).fov as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(fov)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJ__bindgen_ty_2__bindgen_ty_1>())).aspect as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(aspect)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct COBJ__bindgen_ty_2__bindgen_ty_2 {
    pub top: f32_,
    pub bottom: f32_,
    pub left: f32_,
    pub right: f32_,
}
#[test]
fn bindgen_test_layout_COBJ__bindgen_ty_2__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<COBJ__bindgen_ty_2__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(COBJ__bindgen_ty_2__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<COBJ__bindgen_ty_2__bindgen_ty_2>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJ__bindgen_ty_2__bindgen_ty_2>())).top as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJ__bindgen_ty_2__bindgen_ty_2>())).bottom as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJ__bindgen_ty_2__bindgen_ty_2>())).left as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJ__bindgen_ty_2__bindgen_ty_2>())).right as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_2),
            "::",
            stringify!(right)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct COBJ__bindgen_ty_2__bindgen_ty_3 {
    pub top: f32_,
    pub bottom: f32_,
    pub left: f32_,
    pub right: f32_,
}
#[test]
fn bindgen_test_layout_COBJ__bindgen_ty_2__bindgen_ty_3() {
    assert_eq!(
        ::std::mem::size_of::<COBJ__bindgen_ty_2__bindgen_ty_3>(),
        16usize,
        concat!("Size of: ", stringify!(COBJ__bindgen_ty_2__bindgen_ty_3))
    );
    assert_eq!(
        ::std::mem::align_of::<COBJ__bindgen_ty_2__bindgen_ty_3>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJ__bindgen_ty_2__bindgen_ty_3>())).top as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_3),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJ__bindgen_ty_2__bindgen_ty_3>())).bottom as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_3),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJ__bindgen_ty_2__bindgen_ty_3>())).left as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_3),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<COBJ__bindgen_ty_2__bindgen_ty_3>())).right as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2__bindgen_ty_3),
            "::",
            stringify!(right)
        )
    );
}
#[test]
fn bindgen_test_layout_COBJ__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<COBJ__bindgen_ty_2>(),
        16usize,
        concat!("Size of: ", stringify!(COBJ__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<COBJ__bindgen_ty_2>(),
        4usize,
        concat!("Alignment of ", stringify!(COBJ__bindgen_ty_2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ__bindgen_ty_2>())).perspective as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2),
            "::",
            stringify!(perspective)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ__bindgen_ty_2>())).frustrum as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2),
            "::",
            stringify!(frustrum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ__bindgen_ty_2>())).ortho as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ__bindgen_ty_2),
            "::",
            stringify!(ortho)
        )
    );
}
#[test]
fn bindgen_test_layout_COBJ() {
    assert_eq!(
        ::std::mem::size_of::<COBJ>(),
        200usize,
        concat!("Size of: ", stringify!(COBJ))
    );
    assert_eq!(
        ::std::mem::align_of::<COBJ>(),
        8usize,
        concat!("Alignment of ", stringify!(COBJ))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).parent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).viewport_left as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(viewport_left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).viewport_right as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(viewport_right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).viewport_top as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(viewport_top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).viewport_bottom as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(viewport_bottom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).scissor_left as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(scissor_left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).scissor_right as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(scissor_right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).scissor_top as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(scissor_top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).scissor_bottom as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(scissor_bottom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).eye_position as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(eye_position)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).interest as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(interest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).u as *const _ as usize },
        56usize,
        concat!("Offset of field: ", stringify!(COBJ), "::", stringify!(u))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).near as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(near)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).far as *const _ as usize },
        72usize,
        concat!("Offset of field: ", stringify!(COBJ), "::", stringify!(far))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).projection_param as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(projection_param)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).projection_type as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(projection_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).view_mtx as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(view_mtx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).aobj as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(aobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<COBJ>())).proj_mtx as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(COBJ),
            "::",
            stringify!(proj_mtx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _HSD_ImageDesc {
    pub img_ptr: *mut ::std::os::raw::c_void,
    pub width: u16_,
    pub height: u16_,
    pub format: u32_,
    pub mipmap: u32_,
    pub minLOD: f32_,
    pub maxLOD: f32_,
}
#[test]
fn bindgen_test_layout__HSD_ImageDesc() {
    assert_eq!(
        ::std::mem::size_of::<_HSD_ImageDesc>(),
        32usize,
        concat!("Size of: ", stringify!(_HSD_ImageDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<_HSD_ImageDesc>(),
        8usize,
        concat!("Alignment of ", stringify!(_HSD_ImageDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_ImageDesc>())).img_ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_ImageDesc),
            "::",
            stringify!(img_ptr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_ImageDesc>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_ImageDesc),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_ImageDesc>())).height as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_ImageDesc),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_ImageDesc>())).format as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_ImageDesc),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_ImageDesc>())).mipmap as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_ImageDesc),
            "::",
            stringify!(mipmap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_ImageDesc>())).minLOD as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_ImageDesc),
            "::",
            stringify!(minLOD)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_ImageDesc>())).maxLOD as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_ImageDesc),
            "::",
            stringify!(maxLOD)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _HSD_LightPoint {
    pub cutoff: f32_,
    pub point_func: u8_,
    pub ref_br: f32_,
    pub ref_dist: f32_,
    pub dist_func: u8_,
}
#[test]
fn bindgen_test_layout__HSD_LightPoint() {
    assert_eq!(
        ::std::mem::size_of::<_HSD_LightPoint>(),
        20usize,
        concat!("Size of: ", stringify!(_HSD_LightPoint))
    );
    assert_eq!(
        ::std::mem::align_of::<_HSD_LightPoint>(),
        4usize,
        concat!("Alignment of ", stringify!(_HSD_LightPoint))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightPoint>())).cutoff as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightPoint),
            "::",
            stringify!(cutoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightPoint>())).point_func as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightPoint),
            "::",
            stringify!(point_func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightPoint>())).ref_br as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightPoint),
            "::",
            stringify!(ref_br)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightPoint>())).ref_dist as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightPoint),
            "::",
            stringify!(ref_dist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightPoint>())).dist_func as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightPoint),
            "::",
            stringify!(dist_func)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _HSD_LightPointDesc {
    pub cutoff: f32_,
    pub point_func: u8_,
    pub ref_br: f32_,
    pub ref_dist: f32_,
    pub dist_func: u8_,
}
#[test]
fn bindgen_test_layout__HSD_LightPointDesc() {
    assert_eq!(
        ::std::mem::size_of::<_HSD_LightPointDesc>(),
        20usize,
        concat!("Size of: ", stringify!(_HSD_LightPointDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<_HSD_LightPointDesc>(),
        4usize,
        concat!("Alignment of ", stringify!(_HSD_LightPointDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightPointDesc>())).cutoff as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightPointDesc),
            "::",
            stringify!(cutoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightPointDesc>())).point_func as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightPointDesc),
            "::",
            stringify!(point_func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightPointDesc>())).ref_br as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightPointDesc),
            "::",
            stringify!(ref_br)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightPointDesc>())).ref_dist as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightPointDesc),
            "::",
            stringify!(ref_dist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightPointDesc>())).dist_func as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightPointDesc),
            "::",
            stringify!(dist_func)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _HSD_LightSpot {
    pub cutoff: f32_,
    pub spot_func: u8_,
    pub ref_br: f32_,
    pub ref_dist: f32_,
    pub dist_func: u8_,
}
#[test]
fn bindgen_test_layout__HSD_LightSpot() {
    assert_eq!(
        ::std::mem::size_of::<_HSD_LightSpot>(),
        20usize,
        concat!("Size of: ", stringify!(_HSD_LightSpot))
    );
    assert_eq!(
        ::std::mem::align_of::<_HSD_LightSpot>(),
        4usize,
        concat!("Alignment of ", stringify!(_HSD_LightSpot))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightSpot>())).cutoff as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightSpot),
            "::",
            stringify!(cutoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightSpot>())).spot_func as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightSpot),
            "::",
            stringify!(spot_func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightSpot>())).ref_br as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightSpot),
            "::",
            stringify!(ref_br)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightSpot>())).ref_dist as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightSpot),
            "::",
            stringify!(ref_dist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightSpot>())).dist_func as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightSpot),
            "::",
            stringify!(dist_func)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _HSD_LightSpotDesc {
    pub cutoff: f32_,
    pub spot_func: u8_,
    pub ref_br: f32_,
    pub ref_dist: f32_,
    pub dist_func: u8_,
}
#[test]
fn bindgen_test_layout__HSD_LightSpotDesc() {
    assert_eq!(
        ::std::mem::size_of::<_HSD_LightSpotDesc>(),
        20usize,
        concat!("Size of: ", stringify!(_HSD_LightSpotDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<_HSD_LightSpotDesc>(),
        4usize,
        concat!("Alignment of ", stringify!(_HSD_LightSpotDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightSpotDesc>())).cutoff as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightSpotDesc),
            "::",
            stringify!(cutoff)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightSpotDesc>())).spot_func as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightSpotDesc),
            "::",
            stringify!(spot_func)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightSpotDesc>())).ref_br as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightSpotDesc),
            "::",
            stringify!(ref_br)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightSpotDesc>())).ref_dist as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightSpotDesc),
            "::",
            stringify!(ref_dist)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightSpotDesc>())).dist_func as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightSpotDesc),
            "::",
            stringify!(dist_func)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _HSD_LightAttn {
    pub a0: f32_,
    pub a1: f32_,
    pub a2: f32_,
    pub k0: f32_,
    pub k1: f32_,
    pub k2: f32_,
}
#[test]
fn bindgen_test_layout__HSD_LightAttn() {
    assert_eq!(
        ::std::mem::size_of::<_HSD_LightAttn>(),
        24usize,
        concat!("Size of: ", stringify!(_HSD_LightAttn))
    );
    assert_eq!(
        ::std::mem::align_of::<_HSD_LightAttn>(),
        4usize,
        concat!("Alignment of ", stringify!(_HSD_LightAttn))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightAttn>())).a0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightAttn),
            "::",
            stringify!(a0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightAttn>())).a1 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightAttn),
            "::",
            stringify!(a1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightAttn>())).a2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightAttn),
            "::",
            stringify!(a2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightAttn>())).k0 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightAttn),
            "::",
            stringify!(k0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightAttn>())).k1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightAttn),
            "::",
            stringify!(k1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<_HSD_LightAttn>())).k2 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_HSD_LightAttn),
            "::",
            stringify!(k2)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct LOBJ {
    pub parent: u64_,
    pub flags: u16_,
    pub priority: u16_,
    pub next: *mut LOBJ,
    pub color: GXColor,
    pub hw_color: GXColor,
    pub position: *mut WOBJ,
    pub interest: *mut WOBJ,
    pub u: LOBJ__bindgen_ty_1,
    pub shininess: f32_,
    pub lvec: Vec3,
    pub aobj: *mut AOBJ,
    pub id: u32_,
    pub spec_id: u32_,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union LOBJ__bindgen_ty_1 {
    pub point: _HSD_LightPoint,
    pub spot: _HSD_LightSpot,
    pub attn: _HSD_LightAttn,
    _bindgen_union_align: [u32; 6usize],
}
#[test]
fn bindgen_test_layout_LOBJ__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<LOBJ__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(LOBJ__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<LOBJ__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(LOBJ__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ__bindgen_ty_1>())).point as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ__bindgen_ty_1),
            "::",
            stringify!(point)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ__bindgen_ty_1>())).spot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ__bindgen_ty_1),
            "::",
            stringify!(spot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ__bindgen_ty_1>())).attn as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ__bindgen_ty_1),
            "::",
            stringify!(attn)
        )
    );
}
#[test]
fn bindgen_test_layout_LOBJ() {
    assert_eq!(
        ::std::mem::size_of::<LOBJ>(),
        104usize,
        concat!("Size of: ", stringify!(LOBJ))
    );
    assert_eq!(
        ::std::mem::align_of::<LOBJ>(),
        8usize,
        concat!("Alignment of ", stringify!(LOBJ))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).parent as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).flags as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).priority as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(priority)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).next as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).color as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).hw_color as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(hw_color)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).position as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).interest as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(interest)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).u as *const _ as usize },
        48usize,
        concat!("Offset of field: ", stringify!(LOBJ), "::", stringify!(u))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).shininess as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(shininess)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).lvec as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(lvec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).aobj as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(aobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).id as *const _ as usize },
        96usize,
        concat!("Offset of field: ", stringify!(LOBJ), "::", stringify!(id))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<LOBJ>())).spec_id as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(LOBJ),
            "::",
            stringify!(spec_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct JOBJAnimSet {
    pub jobj: *mut JOBJDesc,
    pub animjoint: *mut ::std::os::raw::c_void,
    pub matanimjoint: *mut ::std::os::raw::c_void,
    pub shapeaninjoint: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_JOBJAnimSet() {
    assert_eq!(
        ::std::mem::size_of::<JOBJAnimSet>(),
        32usize,
        concat!("Size of: ", stringify!(JOBJAnimSet))
    );
    assert_eq!(
        ::std::mem::align_of::<JOBJAnimSet>(),
        8usize,
        concat!("Alignment of ", stringify!(JOBJAnimSet))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJAnimSet>())).jobj as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJAnimSet),
            "::",
            stringify!(jobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJAnimSet>())).animjoint as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJAnimSet),
            "::",
            stringify!(animjoint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJAnimSet>())).matanimjoint as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJAnimSet),
            "::",
            stringify!(matanimjoint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<JOBJAnimSet>())).shapeaninjoint as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(JOBJAnimSet),
            "::",
            stringify!(shapeaninjoint)
        )
    );
}
extern "C" {
    pub static mut stc_gobj_list: *mut *mut GOBJList;
}
extern "C" {
    pub static mut obj_kind: *mut u8_;
}
extern "C" {
    #[doc = " Functions"]
    pub fn JOBJ_GetWorldPosition(
        source: *mut JOBJ,
        add: *mut Vec3,
        dest: *mut Vec3,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn JOBJ_SetMtxDirtySub(jobj: *mut JOBJ);
}
extern "C" {
    pub fn JOBJ_LoadJoint(joint: *mut JOBJDesc) -> *mut JOBJ;
}
extern "C" {
    pub fn JOBJ_RemoveAll(joint: *mut JOBJ);
}
extern "C" {
    pub fn JOBJ_Remove(joint: *mut JOBJ);
}
extern "C" {
    pub fn JOBJ_GetChild(
        joint: *mut JOBJ,
        ptr: ::std::os::raw::c_int,
        index: ::std::os::raw::c_int,
        ...
    );
}
extern "C" {
    pub fn JOBJ_AddChild(parent: *mut JOBJ, child: *mut JOBJ);
}
extern "C" {
    pub fn JOBJ_GetCurrentMatAnimFrame(joint: *mut JOBJ) -> f32;
}
extern "C" {
    pub fn JOBJ_SetFlags(joint: *mut JOBJ, flags: ::std::os::raw::c_int);
}
extern "C" {
    pub fn JOBJ_SetFlagsAll(joint: *mut JOBJ, flags: ::std::os::raw::c_int);
}
extern "C" {
    pub fn JOBJ_ClearFlags(joint: *mut JOBJ, flags: ::std::os::raw::c_int);
}
extern "C" {
    pub fn JOBJ_ClearFlagsAll(joint: *mut JOBJ, flags: ::std::os::raw::c_int);
}
extern "C" {
    pub fn JOBJ_BillBoard(joint: *mut JOBJ, m: *mut Mtx, mx: *mut Mtx);
}
extern "C" {
    pub fn JOBJ_RunAOBJCallback(
        joint: *mut JOBJ,
        unk: ::std::os::raw::c_int,
        flags: u16_,
        cb: *mut ::std::os::raw::c_void,
        argkind: ::std::os::raw::c_int,
        ...
    );
}
extern "C" {
    pub fn JOBJ_Anim(joint: *mut JOBJ);
}
extern "C" {
    pub fn JOBJ_AnimAll(joint: *mut JOBJ);
}
extern "C" {
    pub fn JOBJ_AddAnimAll(
        joint: *mut JOBJ,
        animjoint: *mut ::std::os::raw::c_void,
        matanimjoint: *mut ::std::os::raw::c_void,
        shapeanimjoint: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn JOBJ_RemoveAnimAll(joint: *mut JOBJ);
}
extern "C" {
    pub fn JOBJ_ReqAnim(joint: *mut JOBJ, frame: f32);
}
extern "C" {
    pub fn JOBJ_ReqAnimByFlags(joint: *mut JOBJ, flags: ::std::os::raw::c_int, frame: f32);
}
extern "C" {
    pub fn JOBJ_ReqAnimAll(joint: *mut JOBJ, unk: f32);
}
extern "C" {
    pub fn JOBJ_ReqAnimAllByFlags(joint: *mut JOBJ, flags: ::std::os::raw::c_int, frame: f32);
}
extern "C" {
    pub fn JOBJ_GetJointAnimFrameTotal(joint: *mut JOBJ) -> f32;
}
extern "C" {
    pub fn JOBJ_GetJointAnimNextFrame(joint: *mut JOBJ) -> f32;
}
extern "C" {
    pub fn JOBJ_SetAllMOBJFlags(joint: *mut JOBJ, flags: ::std::os::raw::c_int);
}
extern "C" {
    pub fn JOBJ_CheckAObjEnd(joint: *mut JOBJ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn AOBJ_ReqAnim(aobj: *mut ::std::os::raw::c_int, unk: f32);
}
extern "C" {
    pub fn AOBJ_StopAnim(
        jobj: *mut JOBJ,
        flags: ::std::os::raw::c_int,
        flags2: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn AOBJ_SetRate(aobj: *mut AOBJ, rate: f32);
}
extern "C" {
    pub fn DOBJ_SetFlags(dobj: *mut DOBJ, flags: ::std::os::raw::c_int);
}
extern "C" {
    pub fn DOBJ_ClearFlags(dobj: *mut DOBJ, flags: ::std::os::raw::c_int);
}
extern "C" {
    pub fn COBJ_LoadDesc(cobj: *mut COBJDesc) -> *mut COBJ;
}
extern "C" {
    pub fn COBJ_LoadDescSetScissor(cobj: *mut COBJDesc) -> *mut COBJ;
}
extern "C" {
    pub fn COBJ_GetMatchCamera() -> *mut COBJ;
}
extern "C" {
    pub fn CObjThink_Common(gobj: *mut GOBJ);
}
extern "C" {
    pub fn GObj_Create(
        type_: ::std::os::raw::c_int,
        subclass: ::std::os::raw::c_int,
        flags: ::std::os::raw::c_int,
    ) -> *mut GOBJ;
}
extern "C" {
    pub fn GObj_Destroy(gobj: *mut GOBJ);
}
extern "C" {
    pub fn GObj_AddGXLink(
        gobj: *mut GOBJ,
        cb: *mut ::std::os::raw::c_void,
        gx_link: ::std::os::raw::c_int,
        gx_pri: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn GObj_DestroyGXLink(gobj: *mut GOBJ);
}
extern "C" {
    pub fn GObj_GXReorder(gobj: *mut GOBJ, unk: ::std::os::raw::c_int);
}
extern "C" {
    pub fn GObj_AddProc(
        gobj: *mut GOBJ,
        callback: *mut ::std::os::raw::c_void,
        priority: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn GObj_RemoveProc(gobj: *mut GOBJ);
}
extern "C" {
    pub fn GObj_AddObject(gobj: *mut GOBJ, unk: u8_, object: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn GObj_FreeObject(gobj: *mut GOBJ);
}
extern "C" {
    pub fn GObj_AddUserData(
        gobj: *mut GOBJ,
        userDataKind: ::std::os::raw::c_int,
        destructor: *mut ::std::os::raw::c_void,
        userData: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn GOBJ_InitCamera(
        gobj: *mut GOBJ,
        cb: *mut ::std::os::raw::c_void,
        gx_pri: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn GXLink_Common(gobj: *mut GOBJ, pass: ::std::os::raw::c_int);
}
extern "C" {
    pub fn GXLink_LObj(gobj: *mut GOBJ, pass: ::std::os::raw::c_int);
}
extern "C" {
    pub fn GXLink_Fog(gobj: *mut GOBJ, pass: ::std::os::raw::c_int);
}
extern "C" {
    pub fn LObj_LoadDesc(lobjdesc: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn Fog_LoadDesc(fogdesc: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn JOBJ_GetDObj(jobj: *mut JOBJ) -> *mut DOBJ;
}
extern "C" {
    pub fn MOBJ_SetAlpha(dobj: *mut DOBJ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn GObj_CopyGXPri(target: *mut GOBJ, source: *mut GOBJ);
}
#[doc = " Structs"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Effect {
    pub child: *mut GOBJ,
    pub gobj: *mut GOBJ,
    pub x8: ::std::os::raw::c_int,
    pub xc: ::std::os::raw::c_int,
    pub callback: *mut ::std::os::raw::c_void,
    pub x14: ::std::os::raw::c_int,
    pub x18: ::std::os::raw::c_int,
    pub x1c: ::std::os::raw::c_int,
    pub x20: f32,
    pub lifetime: ::std::os::raw::c_short,
    pub x26: ::std::os::raw::c_char,
    pub x27: ::std::os::raw::c_char,
    pub x28: ::std::os::raw::c_char,
    pub x29: ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_Effect() {
    assert_eq!(
        ::std::mem::size_of::<Effect>(),
        56usize,
        concat!("Size of: ", stringify!(Effect))
    );
    assert_eq!(
        ::std::mem::align_of::<Effect>(),
        8usize,
        concat!("Alignment of ", stringify!(Effect))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).child as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(child)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).gobj as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(gobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).x8 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(x8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).xc as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(xc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).callback as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).x14 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(x14)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).x18 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(x18)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).x1c as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(x1c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).x20 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(x20)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).lifetime as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(lifetime)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).x26 as *const _ as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(x26)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).x27 as *const _ as usize },
        51usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(x27)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).x28 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(x28)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Effect>())).x29 as *const _ as usize },
        53usize,
        concat!(
            "Offset of field: ",
            stringify!(Effect),
            "::",
            stringify!(x29)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Particle {
    pub x0: ::std::os::raw::c_int,
    pub x4: ::std::os::raw::c_int,
    pub x8: ::std::os::raw::c_int,
    pub xc: ::std::os::raw::c_int,
    pub x10: ::std::os::raw::c_int,
    pub x14: ::std::os::raw::c_int,
    pub x18: ::std::os::raw::c_int,
    pub x1c: ::std::os::raw::c_int,
    pub x20: ::std::os::raw::c_int,
    pub x24: ::std::os::raw::c_int,
    pub x28: ::std::os::raw::c_int,
    pub x2c: ::std::os::raw::c_int,
    pub x30: ::std::os::raw::c_int,
    pub x34: ::std::os::raw::c_int,
    pub x38: ::std::os::raw::c_int,
    pub x3c: ::std::os::raw::c_int,
    pub x40: ::std::os::raw::c_int,
    pub x44: ::std::os::raw::c_int,
    pub x48: ::std::os::raw::c_int,
    pub x4c: ::std::os::raw::c_int,
    pub x50: ::std::os::raw::c_int,
    pub param: *mut GeneratorAppSRT,
}
#[test]
fn bindgen_test_layout_Particle() {
    assert_eq!(
        ::std::mem::size_of::<Particle>(),
        96usize,
        concat!("Size of: ", stringify!(Particle))
    );
    assert_eq!(
        ::std::mem::align_of::<Particle>(),
        8usize,
        concat!("Alignment of ", stringify!(Particle))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x4 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x8 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).xc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(xc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x10 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x10)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x14 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x14)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x18 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x18)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x1c as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x1c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x20 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x20)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x24 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x24)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x28 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x28)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x2c as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x2c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x30 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x30)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x34 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x34)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x38 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x38)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x3c as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x3c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x40 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x40)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x44 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x44)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x48 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x48)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x4c as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x4c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).x50 as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(x50)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle>())).param as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle),
            "::",
            stringify!(param)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ptclGen {
    pub next: *mut ptclGen,
    pub kind: ::std::os::raw::c_int,
    pub random: f32,
    pub xc: f32,
    pub joint: *mut JOBJ,
    pub genlife: u16_,
    pub type_: u16_,
    pub ef_file: u8_,
    pub link_no: u8_,
    pub tex_group: u8_,
    pub x1b: u8_,
    pub instance: u16_,
    pub life: u16_,
    pub track: *mut ::std::os::raw::c_void,
    pub pos: Vec3,
    pub vel: Vec3,
    pub gravity: f32,
    pub friction: f32,
    pub size: f32,
    pub radius: f32,
    pub angle: f32,
    pub timer: ::std::os::raw::c_int,
    pub mtx: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ptclGen() {
    assert_eq!(
        ::std::mem::size_of::<ptclGen>(),
        112usize,
        concat!("Size of: ", stringify!(ptclGen))
    );
    assert_eq!(
        ::std::mem::align_of::<ptclGen>(),
        8usize,
        concat!("Alignment of ", stringify!(ptclGen))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).kind as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).random as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(random)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).xc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(xc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).joint as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(joint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).genlife as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(genlife)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).type_ as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).ef_file as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(ef_file)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).link_no as *const _ as usize },
        37usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(link_no)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).tex_group as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(tex_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).x1b as *const _ as usize },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(x1b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).instance as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(instance)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).life as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(life)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).track as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(track)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).pos as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).vel as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(vel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).gravity as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(gravity)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).friction as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(friction)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).size as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).radius as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).angle as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(angle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).timer as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(timer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ptclGen>())).mtx as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ptclGen),
            "::",
            stringify!(mtx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GeneratorAppSRT {
    pub x0: ::std::os::raw::c_int,
    pub x4: ::std::os::raw::c_int,
    pub x8: ::std::os::raw::c_int,
    pub xc: ::std::os::raw::c_int,
    pub x10: ::std::os::raw::c_int,
    pub x14: ::std::os::raw::c_int,
    pub x18: ::std::os::raw::c_int,
    pub x1c: ::std::os::raw::c_int,
    pub x20: ::std::os::raw::c_int,
    pub scale: Vec3,
    pub x30: ::std::os::raw::c_int,
    pub x34: ::std::os::raw::c_int,
    pub x38: ::std::os::raw::c_int,
    pub x3c: ::std::os::raw::c_int,
    pub x40: ::std::os::raw::c_int,
    pub x44: ::std::os::raw::c_int,
    pub x48: ::std::os::raw::c_int,
    pub x4c: ::std::os::raw::c_int,
    pub x50: ::std::os::raw::c_int,
    pub x54: ::std::os::raw::c_int,
    pub x58: ::std::os::raw::c_int,
    pub x5c: ::std::os::raw::c_int,
    pub x60: ::std::os::raw::c_int,
    pub x64: ::std::os::raw::c_int,
    pub x68: ::std::os::raw::c_int,
    pub x6c: ::std::os::raw::c_int,
    pub x70: ::std::os::raw::c_int,
    pub x74: ::std::os::raw::c_int,
    pub x78: ::std::os::raw::c_int,
    pub x7c: ::std::os::raw::c_int,
    pub x80: ::std::os::raw::c_int,
    pub x84: ::std::os::raw::c_int,
    pub x88: ::std::os::raw::c_int,
    pub x8c: ::std::os::raw::c_int,
    pub x90: ::std::os::raw::c_int,
    pub x94: ::std::os::raw::c_int,
    pub x98: ::std::os::raw::c_int,
    pub x9c: ::std::os::raw::c_int,
    pub xa0: ::std::os::raw::c_int,
    pub xa2: u16_,
}
#[test]
fn bindgen_test_layout_GeneratorAppSRT() {
    assert_eq!(
        ::std::mem::size_of::<GeneratorAppSRT>(),
        168usize,
        concat!("Size of: ", stringify!(GeneratorAppSRT))
    );
    assert_eq!(
        ::std::mem::align_of::<GeneratorAppSRT>(),
        4usize,
        concat!("Alignment of ", stringify!(GeneratorAppSRT))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x4 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x8 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).xc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(xc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x10 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x10)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x14 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x14)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x18 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x18)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x1c as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x1c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x20 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x20)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).scale as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x30 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x30)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x34 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x34)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x38 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x38)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x3c as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x3c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x40 as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x40)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x44 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x44)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x48 as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x48)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x4c as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x4c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x50 as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x50)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x54 as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x54)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x58 as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x58)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x5c as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x5c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x60 as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x60)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x64 as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x64)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x68 as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x68)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x6c as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x6c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x70 as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x70)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x74 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x74)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x78 as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x78)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x7c as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x7c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x80 as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x80)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x84 as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x84)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x88 as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x88)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x8c as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x8c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x90 as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x90)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x94 as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x94)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x98 as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x98)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).x9c as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(x9c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).xa0 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(xa0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GeneratorAppSRT>())).xa2 as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(GeneratorAppSRT),
            "::",
            stringify!(xa2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Particle2 {
    pub next: *mut Particle2,
    pub kind: u32_,
    pub bank: u8_,
    pub texGroup: u8_,
    pub poseNum: u8_,
    pub palNum: u8_,
    pub sizeCount: u16_,
    pub primColCount: u16_,
    pub envColCount: u16_,
    pub primCol: [u8_; 4usize],
    pub envCol: [u8_; 4usize],
    pub cmdWait: u16_,
    pub loopCount: u8_,
    pub linkNo: u8_,
    pub idnum: u16_,
    pub cmdList: *mut ::std::os::raw::c_void,
    pub cmdPtr: u16_,
    pub cmdMarkPtr: u16_,
    pub cmdLoopPtr: u16_,
    pub life: u16_,
    pub v: Vec3,
    pub grav: f32,
    pub fric: f32,
    pub pos: Vec3,
    pub size: f32,
    pub rotate: f32,
    pub aCmpCount: u16_,
    pub aCmpMode: u8_,
    pub aCmpParam1: u8_,
    pub aCmpParam2: u8_,
    pub x5c: *mut ::std::os::raw::c_void,
    pub x60: *mut ::std::os::raw::c_void,
    pub x64: *mut ::std::os::raw::c_void,
    pub x68: *mut ::std::os::raw::c_void,
    pub x6c: *mut ::std::os::raw::c_void,
    pub x70: *mut ::std::os::raw::c_void,
    pub x74: *mut ::std::os::raw::c_void,
    pub x78: *mut ::std::os::raw::c_void,
    pub x7c: *mut ::std::os::raw::c_void,
    pub x80: *mut ::std::os::raw::c_void,
    pub x84: *mut ::std::os::raw::c_void,
    pub x88: *mut ::std::os::raw::c_void,
    pub gen: *mut ::std::os::raw::c_void,
    pub x90: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_Particle2() {
    assert_eq!(
        ::std::mem::size_of::<Particle2>(),
        216usize,
        concat!("Size of: ", stringify!(Particle2))
    );
    assert_eq!(
        ::std::mem::align_of::<Particle2>(),
        8usize,
        concat!("Alignment of ", stringify!(Particle2))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).kind as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).bank as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(bank)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).texGroup as *const _ as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(texGroup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).poseNum as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(poseNum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).palNum as *const _ as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(palNum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).sizeCount as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(sizeCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).primColCount as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(primColCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).envColCount as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(envColCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).primCol as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(primCol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).envCol as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(envCol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).cmdWait as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(cmdWait)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).loopCount as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(loopCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).linkNo as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(linkNo)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).idnum as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(idnum)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).cmdList as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(cmdList)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).cmdPtr as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(cmdPtr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).cmdMarkPtr as *const _ as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(cmdMarkPtr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).cmdLoopPtr as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(cmdLoopPtr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).life as *const _ as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(life)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).v as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(v)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).grav as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(grav)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).fric as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(fric)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).pos as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).size as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).rotate as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(rotate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).aCmpCount as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(aCmpCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).aCmpMode as *const _ as usize },
        98usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(aCmpMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).aCmpParam1 as *const _ as usize },
        99usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(aCmpParam1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).aCmpParam2 as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(aCmpParam2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x5c as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x5c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x60 as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x60)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x64 as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x64)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x68 as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x68)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x6c as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x6c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x70 as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x70)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x74 as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x74)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x78 as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x78)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x7c as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x7c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x80 as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x80)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x84 as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x84)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x88 as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x88)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).gen as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(gen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Particle2>())).x90 as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(Particle2),
            "::",
            stringify!(x90)
        )
    );
}
extern "C" {
    #[doc = " Functions"]
    pub fn Effect_SpawnSync(gfx_id: ::std::os::raw::c_int, ...) -> *mut Effect;
}
extern "C" {
    pub fn Effect_SpawnAsync(
        fighter: *mut GOBJ,
        ptr: *mut Effect,
        type_: ::std::os::raw::c_int,
        gfx_id: ::std::os::raw::c_int,
        ...
    );
}
extern "C" {
    pub fn Effect_SpawnFtEffectLookup(
        gobj: *mut GOBJ,
        gfx_id: ::std::os::raw::c_int,
        bone: ::std::os::raw::c_int,
        unk: ::std::os::raw::c_int,
        destroy_on_leave: ::std::os::raw::c_int,
        ...
    );
}
extern "C" {
    pub fn Effect_SpawnItEffectLookup(
        gobj: *mut GOBJ,
        gfx_id: ::std::os::raw::c_int,
        bone: ::std::os::raw::c_int,
        offset: *mut Vec3,
        scatter: *mut Vec3,
        unk3: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Effect_SpawnItEffect(gobj: *mut GOBJ, gfx_id: ::std::os::raw::c_int);
}
extern "C" {
    pub fn Effect_DestroyAll(fighter: *mut GOBJ);
}
extern "C" {
    pub fn Particle_DestroyAll(jobj: *mut JOBJ);
}
extern "C" {
    pub fn Effect_PauseAll(fighter: *mut GOBJ);
}
extern "C" {
    pub fn Effect_ResumeAll(fighter: *mut GOBJ);
}
extern "C" {
    pub fn psRemoveParticleAppSRT(ptcl: *mut Particle2) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn psDeletePntJObjwithParticle(ptcl: *mut Particle2);
}
extern "C" {
    pub fn psKillGenerator(gen: *mut ptclGen, unk: *mut ptclGen) -> *mut ptclGen;
}
extern "C" {
    pub static mut stc_ptclnum: *mut u16_;
}
extern "C" {
    pub static mut stc_ptcl: *mut *mut Particle2;
}
extern "C" {
    pub static mut stc_ptclgen: *mut *mut ptclGen;
}
extern "C" {
    pub static mut stc_ptclgencurr: *mut *mut ptclGen;
}
extern "C" {
    pub static mut stc_ptclgennum: *mut u16_;
}
#[doc = " Structs"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ECBBones {
    pub topY: f32,
    pub botY: f32,
    pub left: Vec2,
    pub right: Vec2,
}
#[test]
fn bindgen_test_layout_ECBBones() {
    assert_eq!(
        ::std::mem::size_of::<ECBBones>(),
        24usize,
        concat!("Size of: ", stringify!(ECBBones))
    );
    assert_eq!(
        ::std::mem::align_of::<ECBBones>(),
        4usize,
        concat!("Alignment of ", stringify!(ECBBones))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ECBBones>())).topY as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ECBBones),
            "::",
            stringify!(topY)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ECBBones>())).botY as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ECBBones),
            "::",
            stringify!(botY)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ECBBones>())).left as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ECBBones),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ECBBones>())).right as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ECBBones),
            "::",
            stringify!(right)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DmgHazard {
    pub x0: ::std::os::raw::c_int,
    pub dmg: ::std::os::raw::c_int,
    pub angle: ::std::os::raw::c_int,
    pub kb_growth: ::std::os::raw::c_int,
    pub x10: ::std::os::raw::c_int,
    pub kb_base: ::std::os::raw::c_int,
    pub element: ::std::os::raw::c_int,
    pub x1c: ::std::os::raw::c_int,
    pub sfx: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DmgHazard() {
    assert_eq!(
        ::std::mem::size_of::<DmgHazard>(),
        36usize,
        concat!("Size of: ", stringify!(DmgHazard))
    );
    assert_eq!(
        ::std::mem::align_of::<DmgHazard>(),
        4usize,
        concat!("Alignment of ", stringify!(DmgHazard))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DmgHazard>())).x0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DmgHazard),
            "::",
            stringify!(x0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DmgHazard>())).dmg as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DmgHazard),
            "::",
            stringify!(dmg)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DmgHazard>())).angle as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DmgHazard),
            "::",
            stringify!(angle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DmgHazard>())).kb_growth as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(DmgHazard),
            "::",
            stringify!(kb_growth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DmgHazard>())).x10 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DmgHazard),
            "::",
            stringify!(x10)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DmgHazard>())).kb_base as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DmgHazard),
            "::",
            stringify!(kb_base)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DmgHazard>())).element as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DmgHazard),
            "::",
            stringify!(element)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DmgHazard>())).x1c as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DmgHazard),
            "::",
            stringify!(x1c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DmgHazard>())).sfx as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(DmgHazard),
            "::",
            stringify!(sfx)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CollData {
    pub gobj: *mut GOBJ,
    pub topN_Curr: Vec3,
    pub topN_CurrCorrect: Vec3,
    pub topN_Prev: Vec3,
    pub topN_Proj: Vec3,
    pub flags1: ::std::os::raw::c_int,
    pub coll_test: ::std::os::raw::c_int,
    pub ignore_line: ::std::os::raw::c_int,
    pub ledge_left: ::std::os::raw::c_int,
    pub ledge_right: ::std::os::raw::c_int,
    pub ignore_group: ::std::os::raw::c_int,
    pub check_group: ::std::os::raw::c_int,
    pub x50: ::std::os::raw::c_int,
    pub x54: ::std::os::raw::c_int,
    pub x58: ::std::os::raw::c_int,
    pub x5c: ::std::os::raw::c_int,
    pub x60: ::std::os::raw::c_int,
    pub x64: ::std::os::raw::c_int,
    pub x68: ::std::os::raw::c_int,
    pub x6c: ::std::os::raw::c_int,
    pub x70: ::std::os::raw::c_int,
    pub x74: ::std::os::raw::c_int,
    pub x78: ::std::os::raw::c_int,
    pub x7c: ::std::os::raw::c_int,
    pub x80: ::std::os::raw::c_int,
    pub ecbCurr_top: Vec2,
    pub ecbCurr_bot: Vec2,
    pub ecbCurr_right: Vec2,
    pub ecbCurr_left: Vec2,
    pub ecbCurrCorrect_top: Vec2,
    pub ecbCurrCorrect_bot: Vec2,
    pub ecbCurrCorrect_right: Vec2,
    pub ecbCurrCorrect_left: Vec2,
    pub ecbPrev_top: Vec2,
    pub ecbPrev_bot: Vec2,
    pub ecbPrev_right: Vec2,
    pub ecbPrev_left: Vec2,
    pub ecbProj_top: Vec2,
    pub ecbProj_bot: Vec2,
    pub ecbProj_right: Vec2,
    pub ecbProj_left: Vec2,
    pub x104: ::std::os::raw::c_int,
    pub joint_1: *mut JOBJ,
    pub joint_2: *mut JOBJ,
    pub joint_3: *mut JOBJ,
    pub joint_4: *mut JOBJ,
    pub joint_5: *mut JOBJ,
    pub joint_6: *mut JOBJ,
    pub joint_7: *mut JOBJ,
    pub x124: ::std::os::raw::c_int,
    pub x128: ::std::os::raw::c_int,
    pub x12c: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_int,
    pub envFlags: ::std::os::raw::c_int,
    pub envFlags_prev: ::std::os::raw::c_int,
    pub x13c: ::std::os::raw::c_int,
    pub x140: ::std::os::raw::c_int,
    pub x144: ::std::os::raw::c_int,
    pub x148: ::std::os::raw::c_int,
    pub ground_index: ::std::os::raw::c_int,
    pub ground_info: u8_,
    pub ground_unk: u8_,
    pub ground_type: u8_,
    pub ground_mat: u8_,
    pub ground_slope: Vec3,
    pub rightwall_index: ::std::os::raw::c_int,
    pub rightwall_info: u8_,
    pub rightwall_unk: u8_,
    pub rightwall_type: u8_,
    pub rightwall_mat: u8_,
    pub rightwall_slope: Vec3,
    pub leftwall_index: ::std::os::raw::c_int,
    pub leftwall_info: u8_,
    pub leftwall_unk: u8_,
    pub leftwall_type: u8_,
    pub leftwall_mat: u8_,
    pub leftwall_slope: Vec3,
    pub ceil_index: ::std::os::raw::c_int,
    pub ceil_info: u8_,
    pub ceil_unk: u8_,
    pub ceil_type: u8_,
    pub ceil_mat: u8_,
    pub ceil_slope: Vec3,
    pub ecb_lock: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CollData() {
    assert_eq!(
        ::std::mem::size_of::<CollData>(),
        456usize,
        concat!("Size of: ", stringify!(CollData))
    );
    assert_eq!(
        ::std::mem::align_of::<CollData>(),
        8usize,
        concat!("Alignment of ", stringify!(CollData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).gobj as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(gobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).topN_Curr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(topN_Curr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).topN_CurrCorrect as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(topN_CurrCorrect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).topN_Prev as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(topN_Prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).topN_Proj as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(topN_Proj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).flags1 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(flags1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).coll_test as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(coll_test)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ignore_line as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ignore_line)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ledge_left as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ledge_left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ledge_right as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ledge_right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ignore_group as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ignore_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).check_group as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(check_group)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x50 as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x50)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x54 as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x54)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x58 as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x58)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x5c as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x5c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x60 as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x60)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x64 as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x64)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x68 as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x68)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x6c as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x6c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x70 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x70)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x74 as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x74)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x78 as *const _ as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x78)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x7c as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x7c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x80 as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x80)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbCurr_top as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbCurr_top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbCurr_bot as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbCurr_bot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbCurr_right as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbCurr_right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbCurr_left as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbCurr_left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbCurrCorrect_top as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbCurrCorrect_top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbCurrCorrect_bot as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbCurrCorrect_bot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbCurrCorrect_right as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbCurrCorrect_right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbCurrCorrect_left as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbCurrCorrect_left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbPrev_top as *const _ as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbPrev_top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbPrev_bot as *const _ as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbPrev_bot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbPrev_right as *const _ as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbPrev_right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbPrev_left as *const _ as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbPrev_left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbProj_top as *const _ as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbProj_top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbProj_bot as *const _ as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbProj_bot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbProj_right as *const _ as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbProj_right)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecbProj_left as *const _ as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecbProj_left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x104 as *const _ as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x104)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).joint_1 as *const _ as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(joint_1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).joint_2 as *const _ as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(joint_2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).joint_3 as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(joint_3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).joint_4 as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(joint_4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).joint_5 as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(joint_5)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).joint_6 as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(joint_6)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).joint_7 as *const _ as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(joint_7)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x124 as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x124)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x128 as *const _ as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x128)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x12c as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x12c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).flags as *const _ as usize },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).envFlags as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(envFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).envFlags_prev as *const _ as usize },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(envFlags_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x13c as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x13c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x140 as *const _ as usize },
        356usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x140)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x144 as *const _ as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x144)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).x148 as *const _ as usize },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(x148)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ground_index as *const _ as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ground_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ground_info as *const _ as usize },
        372usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ground_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ground_unk as *const _ as usize },
        373usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ground_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ground_type as *const _ as usize },
        374usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ground_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ground_mat as *const _ as usize },
        375usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ground_mat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ground_slope as *const _ as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ground_slope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).rightwall_index as *const _ as usize },
        388usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(rightwall_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).rightwall_info as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(rightwall_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).rightwall_unk as *const _ as usize },
        393usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(rightwall_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).rightwall_type as *const _ as usize },
        394usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(rightwall_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).rightwall_mat as *const _ as usize },
        395usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(rightwall_mat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).rightwall_slope as *const _ as usize },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(rightwall_slope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).leftwall_index as *const _ as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(leftwall_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).leftwall_info as *const _ as usize },
        412usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(leftwall_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).leftwall_unk as *const _ as usize },
        413usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(leftwall_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).leftwall_type as *const _ as usize },
        414usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(leftwall_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).leftwall_mat as *const _ as usize },
        415usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(leftwall_mat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).leftwall_slope as *const _ as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(leftwall_slope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ceil_index as *const _ as usize },
        428usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ceil_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ceil_info as *const _ as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ceil_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ceil_unk as *const _ as usize },
        433usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ceil_unk)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ceil_type as *const _ as usize },
        434usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ceil_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ceil_mat as *const _ as usize },
        435usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ceil_mat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ceil_slope as *const _ as usize },
        436usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ceil_slope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollData>())).ecb_lock as *const _ as usize },
        448usize,
        concat!(
            "Offset of field: ",
            stringify!(CollData),
            "::",
            stringify!(ecb_lock)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CollGroupDesc {
    pub floor_start: u16_,
    pub floor_num: u16_,
    pub ceil_start: u16_,
    pub ceil_num: u16_,
    pub rwall_start: u16_,
    pub rwall_num: u16_,
    pub lwall_start: u16_,
    pub lwall_num: u16_,
    pub dyn_start: u16_,
    pub dyn_num: u16_,
    pub area_min: Vec2,
    pub area_max: Vec2,
    pub vert_start: u16_,
    pub vert_num: u16_,
}
#[test]
fn bindgen_test_layout_CollGroupDesc() {
    assert_eq!(
        ::std::mem::size_of::<CollGroupDesc>(),
        40usize,
        concat!("Size of: ", stringify!(CollGroupDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<CollGroupDesc>(),
        4usize,
        concat!("Alignment of ", stringify!(CollGroupDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).floor_start as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(floor_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).floor_num as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(floor_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).ceil_start as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(ceil_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).ceil_num as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(ceil_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).rwall_start as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(rwall_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).rwall_num as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(rwall_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).lwall_start as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(lwall_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).lwall_num as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(lwall_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).dyn_start as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(dyn_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).dyn_num as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(dyn_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).area_min as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(area_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).area_max as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(area_max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).vert_start as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(vert_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroupDesc>())).vert_num as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroupDesc),
            "::",
            stringify!(vert_num)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CollGroup {
    pub next: *mut CollGroup,
    pub desc: *mut CollGroupDesc,
    pub x8: ::std::os::raw::c_int,
    pub ray_id: u16_,
    pub xe: u16_,
    pub area_min: Vec2,
    pub area_max: Vec2,
    pub jobj: *mut JOBJ,
    pub cb_floor: *mut ::std::os::raw::c_void,
    pub map_data_floor: *mut ::std::os::raw::c_void,
    pub cb_ceil: *mut ::std::os::raw::c_void,
    pub map_data_ceil: *mut ::std::os::raw::c_void,
    pub x34: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CollGroup() {
    assert_eq!(
        ::std::mem::size_of::<CollGroup>(),
        88usize,
        concat!("Size of: ", stringify!(CollGroup))
    );
    assert_eq!(
        ::std::mem::align_of::<CollGroup>(),
        8usize,
        concat!("Alignment of ", stringify!(CollGroup))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).next as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).desc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).x8 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(x8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).ray_id as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(ray_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).xe as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(xe)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).area_min as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(area_min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).area_max as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(area_max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).jobj as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(jobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).cb_floor as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(cb_floor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).map_data_floor as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(map_data_floor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).cb_ceil as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(cb_ceil)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).map_data_ceil as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(map_data_ceil)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollGroup>())).x34 as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(CollGroup),
            "::",
            stringify!(x34)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CollLineInfo {
    pub vert_prev: s16,
    pub vert_next: s16,
    pub line_prev: s16,
    pub line_next: s16,
    pub line_prev_altgroup: s16,
    pub line_next_altgroup: s16,
    pub xc: u8_,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
    pub material: u8_,
}
#[test]
fn bindgen_test_layout_CollLineInfo() {
    assert_eq!(
        ::std::mem::size_of::<CollLineInfo>(),
        16usize,
        concat!("Size of: ", stringify!(CollLineInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<CollLineInfo>(),
        2usize,
        concat!("Alignment of ", stringify!(CollLineInfo))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollLineInfo>())).vert_prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CollLineInfo),
            "::",
            stringify!(vert_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollLineInfo>())).vert_next as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(CollLineInfo),
            "::",
            stringify!(vert_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollLineInfo>())).line_prev as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(CollLineInfo),
            "::",
            stringify!(line_prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollLineInfo>())).line_next as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(CollLineInfo),
            "::",
            stringify!(line_next)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollLineInfo>())).line_prev_altgroup as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CollLineInfo),
            "::",
            stringify!(line_prev_altgroup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollLineInfo>())).line_next_altgroup as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(CollLineInfo),
            "::",
            stringify!(line_next_altgroup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollLineInfo>())).xc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(CollLineInfo),
            "::",
            stringify!(xc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollLineInfo>())).material as *const _ as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(CollLineInfo),
            "::",
            stringify!(material)
        )
    );
}
impl CollLineInfo {
    #[inline]
    pub fn xd_1(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_xd_1(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn xd_2(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_xd_2(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn xd_3(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_xd_3(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn disabled(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_disabled(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_left(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_left(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_right(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_right(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_ceil(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_ceil(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_floor(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_floor(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn xe_1(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_xe_1(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn xe_2(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_xe_2(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn xe_3(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_xe_3(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn xe_4(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_xe_4(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn xe_5(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_xe_5(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_drop(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_drop(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_ledge(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_ledge(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_unk(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_unk(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        xd_1: u8_,
        xd_2: u8_,
        xd_3: u8_,
        disabled: u8_,
        is_left: u8_,
        is_right: u8_,
        is_ceil: u8_,
        is_floor: u8_,
        xe_1: u8_,
        xe_2: u8_,
        xe_3: u8_,
        xe_4: u8_,
        xe_5: u8_,
        is_drop: u8_,
        is_ledge: u8_,
        is_unk: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let xd_1: u8 = unsafe { ::std::mem::transmute(xd_1) };
            xd_1 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let xd_2: u8 = unsafe { ::std::mem::transmute(xd_2) };
            xd_2 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let xd_3: u8 = unsafe { ::std::mem::transmute(xd_3) };
            xd_3 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let disabled: u8 = unsafe { ::std::mem::transmute(disabled) };
            disabled as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let is_left: u8 = unsafe { ::std::mem::transmute(is_left) };
            is_left as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let is_right: u8 = unsafe { ::std::mem::transmute(is_right) };
            is_right as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let is_ceil: u8 = unsafe { ::std::mem::transmute(is_ceil) };
            is_ceil as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let is_floor: u8 = unsafe { ::std::mem::transmute(is_floor) };
            is_floor as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let xe_1: u8 = unsafe { ::std::mem::transmute(xe_1) };
            xe_1 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let xe_2: u8 = unsafe { ::std::mem::transmute(xe_2) };
            xe_2 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let xe_3: u8 = unsafe { ::std::mem::transmute(xe_3) };
            xe_3 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let xe_4: u8 = unsafe { ::std::mem::transmute(xe_4) };
            xe_4 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let xe_5: u8 = unsafe { ::std::mem::transmute(xe_5) };
            xe_5 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let is_drop: u8 = unsafe { ::std::mem::transmute(is_drop) };
            is_drop as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let is_ledge: u8 = unsafe { ::std::mem::transmute(is_ledge) };
            is_ledge as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let is_unk: u8 = unsafe { ::std::mem::transmute(is_unk) };
            is_unk as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CollLine {
    pub info: *mut CollLineInfo,
    pub x4: u8_,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub x6: u8_,
    pub _bitfield_2: __BindgenBitfieldUnit<[u8; 1usize], u8>,
    pub __bindgen_padding_0: u32,
}
#[test]
fn bindgen_test_layout_CollLine() {
    assert_eq!(
        ::std::mem::size_of::<CollLine>(),
        16usize,
        concat!("Size of: ", stringify!(CollLine))
    );
    assert_eq!(
        ::std::mem::align_of::<CollLine>(),
        8usize,
        concat!("Alignment of ", stringify!(CollLine))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollLine>())).info as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CollLine),
            "::",
            stringify!(info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollLine>())).x4 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CollLine),
            "::",
            stringify!(x4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollLine>())).x6 as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(CollLine),
            "::",
            stringify!(x6)
        )
    );
}
impl CollLine {
    #[inline]
    pub fn x5_1(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_x5_1(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn x5_2(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_x5_2(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn x5_3(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_x5_3(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn x5_4(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_x5_4(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn x5_5(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_x5_5(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn x5_6(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_x5_6(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn x5_7(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_x5_7(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_enabled(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_enabled(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        x5_1: u8_,
        x5_2: u8_,
        x5_3: u8_,
        x5_4: u8_,
        x5_5: u8_,
        x5_6: u8_,
        x5_7: u8_,
        is_enabled: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let x5_1: u8 = unsafe { ::std::mem::transmute(x5_1) };
            x5_1 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let x5_2: u8 = unsafe { ::std::mem::transmute(x5_2) };
            x5_2 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let x5_3: u8 = unsafe { ::std::mem::transmute(x5_3) };
            x5_3 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let x5_4: u8 = unsafe { ::std::mem::transmute(x5_4) };
            x5_4 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let x5_5: u8 = unsafe { ::std::mem::transmute(x5_5) };
            x5_5 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let x5_6: u8 = unsafe { ::std::mem::transmute(x5_6) };
            x5_6 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let x5_7: u8 = unsafe { ::std::mem::transmute(x5_7) };
            x5_7 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let is_enabled: u8 = unsafe { ::std::mem::transmute(is_enabled) };
            is_enabled as u64
        });
        __bindgen_bitfield_unit
    }
    #[inline]
    pub fn x7(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(0usize, 4u8) as u8) }
    }
    #[inline]
    pub fn set_x7(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn is_rwall(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_rwall(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_lwall(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_lwall(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_ceil(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_ceil(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn is_floor(&self) -> u8_ {
        unsafe { ::std::mem::transmute(self._bitfield_2.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_is_floor(&mut self, val: u8_) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_2.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_2(
        x7: u8_,
        is_rwall: u8_,
        is_lwall: u8_,
        is_ceil: u8_,
        is_floor: u8_,
    ) -> __BindgenBitfieldUnit<[u8; 1usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let x7: u8 = unsafe { ::std::mem::transmute(x7) };
            x7 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let is_rwall: u8 = unsafe { ::std::mem::transmute(is_rwall) };
            is_rwall as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let is_lwall: u8 = unsafe { ::std::mem::transmute(is_lwall) };
            is_lwall as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let is_ceil: u8 = unsafe { ::std::mem::transmute(is_ceil) };
            is_ceil as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let is_floor: u8 = unsafe { ::std::mem::transmute(is_floor) };
            is_floor as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CollVert {
    pub pos_orig: Vec2,
    pub pos_curr: Vec2,
    pub pos_prev: Vec2,
}
#[test]
fn bindgen_test_layout_CollVert() {
    assert_eq!(
        ::std::mem::size_of::<CollVert>(),
        24usize,
        concat!("Size of: ", stringify!(CollVert))
    );
    assert_eq!(
        ::std::mem::align_of::<CollVert>(),
        4usize,
        concat!("Alignment of ", stringify!(CollVert))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollVert>())).pos_orig as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CollVert),
            "::",
            stringify!(pos_orig)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollVert>())).pos_curr as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CollVert),
            "::",
            stringify!(pos_curr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollVert>())).pos_prev as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CollVert),
            "::",
            stringify!(pos_prev)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CollDataStage {
    pub verts: *mut ::std::os::raw::c_void,
    pub vert_num: ::std::os::raw::c_int,
    pub lines: *mut ::std::os::raw::c_void,
    pub line_num: ::std::os::raw::c_int,
    pub floor_start: u16_,
    pub floor_num: u16_,
    pub ceil_start: u16_,
    pub ceil_num: u16_,
    pub rwall_start: u16_,
    pub rwall_num: u16_,
    pub lwall_start: u16_,
    pub lwall_num: u16_,
    pub dyn_start: u16_,
    pub dyn_num: u16_,
    pub groups: *mut ::std::os::raw::c_void,
    pub group_num: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_CollDataStage() {
    assert_eq!(
        ::std::mem::size_of::<CollDataStage>(),
        64usize,
        concat!("Size of: ", stringify!(CollDataStage))
    );
    assert_eq!(
        ::std::mem::align_of::<CollDataStage>(),
        8usize,
        concat!("Alignment of ", stringify!(CollDataStage))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).verts as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(verts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).vert_num as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(vert_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).lines as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(lines)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).line_num as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(line_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).floor_start as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(floor_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).floor_num as *const _ as usize },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(floor_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).ceil_start as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(ceil_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).ceil_num as *const _ as usize },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(ceil_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).rwall_start as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(rwall_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).rwall_num as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(rwall_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).lwall_start as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(lwall_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).lwall_num as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(lwall_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).dyn_start as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(dyn_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).dyn_num as *const _ as usize },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(dyn_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).groups as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(groups)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<CollDataStage>())).group_num as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(CollDataStage),
            "::",
            stringify!(group_num)
        )
    );
}
extern "C" {
    #[doc = " Functions"]
    pub fn Coll_ECBCurrToPrev(coll_data: *mut CollData);
}
extern "C" {
    pub fn Coll_InitECB(coll_data: *mut CollData);
}
extern "C" {
    pub fn ECB_CollGround_PassLedge(
        ecb: *mut CollData,
        bones: *mut ECBBones,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ECB_CollAir(ecb: *mut CollData, bones: *mut ECBBones);
}
extern "C" {
    pub fn GrColl_GetLedgeLeft(floor_index: ::std::os::raw::c_int, pos: *mut Vec3);
}
extern "C" {
    pub fn GrColl_GetLedgeRight(floor_index: ::std::os::raw::c_int, pos: *mut Vec3);
}
extern "C" {
    pub fn GrColl_GetLedgeLeft2(floor_index: ::std::os::raw::c_int, pos: *mut Vec3);
}
extern "C" {
    pub fn GrColl_GetLedgeRight2(floor_index: ::std::os::raw::c_int, pos: *mut Vec3);
}
extern "C" {
    pub fn GrColl_RaycastGround(
        coll_pos: *mut Vec3,
        line_index: *mut ::std::os::raw::c_int,
        line_kind: *mut ::std::os::raw::c_int,
        unk1: *mut Vec3,
        unk2: *mut Vec3,
        unk3: *mut Vec3,
        unk4: *mut Vec3,
        cb: *mut ::std::os::raw::c_void,
        fromX: f32,
        fromY: f32,
        toX: f32,
        toY: f32,
        unk5: f32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn GrColl_CrawlGround(
        line_index: ::std::os::raw::c_int,
        pos: *mut Vec3,
        return_line: *mut ::std::os::raw::c_int,
        return_pos: *mut Vec3,
        return_flags: *mut ::std::os::raw::c_int,
        return_slope: *mut Vec3,
        x_offset: f32,
        y_offset: f32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn GrColl_GetPosDifference(
        line_index: ::std::os::raw::c_int,
        pos: *mut Vec3,
        return_pos: *mut Vec3,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn GrColl_GetLineInfo(
        line_index: ::std::os::raw::c_int,
        r4: *mut Vec3,
        r5: *mut ::std::os::raw::c_void,
        flags: *mut ::std::os::raw::c_int,
        return_slope: *mut Vec3,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn GrColl_GetLineSlope(line_index: ::std::os::raw::c_int, return_slope: *mut Vec3);
}
extern "C" {
    pub fn GrColl_CheckIfLineEnabled(line_index: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub static mut stc_colltest: *mut ::std::os::raw::c_int;
}
extern "C" {
    pub static mut stc_firstcollgroup: *mut *mut CollGroup;
}
extern "C" {
    pub static mut stc_collgroup: *mut *mut CollGroup;
}
extern "C" {
    pub static mut stc_collline: *mut *mut CollLine;
}
extern "C" {
    pub static mut stc_collvert: *mut *mut CollVert;
}
extern "C" {
    pub static mut stc_colldata: *mut *mut CollDataStage;
}
pub const FtCommonBone_TopN: FtCommonBone = 0;
pub const FtCommonBone_TransN: FtCommonBone = 1;
pub const FtCommonBone_XRotN: FtCommonBone = 2;
pub const FtCommonBone_YRotN: FtCommonBone = 3;
pub const FtCommonBone_HipN: FtCommonBone = 4;
pub const FtCommonBone_WaistN: FtCommonBone = 5;
pub const FtCommonBone_LLegJA: FtCommonBone = 6;
pub const FtCommonBone_LLegJ: FtCommonBone = 7;
pub const FtCommonBone_LKneeJ: FtCommonBone = 8;
pub const FtCommonBone_LFootJA: FtCommonBone = 9;
pub const FtCommonBone_LFootJ: FtCommonBone = 10;
pub const FtCommonBone_RLegJA: FtCommonBone = 11;
pub const FtCommonBone_RLegJ: FtCommonBone = 12;
pub const FtCommonBone_RKneeJ: FtCommonBone = 13;
pub const FtCommonBone_RFootJA: FtCommonBone = 14;
pub const FtCommonBone_RFootJ: FtCommonBone = 15;
pub const FtCommonBone_WaistN2: FtCommonBone = 16;
pub const FtCommonBone_BustN: FtCommonBone = 17;
pub const FtCommonBone_LShoulderN: FtCommonBone = 18;
pub const FtCommonBone_LShoulderJA: FtCommonBone = 19;
pub const FtCommonBone_LShoulderJ: FtCommonBone = 20;
pub const FtCommonBone_LArmJ: FtCommonBone = 21;
pub const FtCommonBone_LHandN: FtCommonBone = 22;
pub const FtCommonBone_L1stNa: FtCommonBone = 23;
pub const FtCommonBone_L1stNb: FtCommonBone = 24;
pub const FtCommonBone_L2ndNa: FtCommonBone = 25;
pub const FtCommonBone_L2ndNb: FtCommonBone = 26;
pub const FtCommonBone_L3rdNa: FtCommonBone = 27;
pub const FtCommonBone_L3rdNb: FtCommonBone = 28;
pub const FtCommonBone_L4thNa: FtCommonBone = 29;
pub const FtCommonBone_L4thNb: FtCommonBone = 30;
pub const FtCommonBone_LHaveN: FtCommonBone = 31;
pub const FtCommonBone_LThumbNa: FtCommonBone = 32;
pub const FtCommonBone_LThumbNb: FtCommonBone = 33;
pub const FtCommonBone_NeckN: FtCommonBone = 34;
pub const FtCommonBone_HeadN: FtCommonBone = 35;
pub const FtCommonBone_RShoulderN: FtCommonBone = 36;
pub const FtCommonBone_RShoulderJA: FtCommonBone = 37;
pub const FtCommonBone_RShoulderJ: FtCommonBone = 38;
pub const FtCommonBone_RArmJ: FtCommonBone = 39;
pub const FtCommonBone_RHandN: FtCommonBone = 40;
pub const FtCommonBone_R1stNa: FtCommonBone = 41;
pub const FtCommonBone_R1stNb: FtCommonBone = 42;
pub const FtCommonBone_R2ndNa: FtCommonBone = 43;
pub const FtCommonBone_R2ndNb: FtCommonBone = 44;
pub const FtCommonBone_R3rdNa: FtCommonBone = 45;
pub const FtCommonBone_R3rdNb: FtCommonBone = 46;
pub const FtCommonBone_R4thNa: FtCommonBone = 47;
pub const FtCommonBone_R4thNb: FtCommonBone = 48;
pub const FtCommonBone_RHaveN: FtCommonBone = 49;
pub const FtCommonBone_RThumbNa: FtCommonBone = 50;
pub const FtCommonBone_RThumbNb: FtCommonBone = 51;
pub const FtCommonBone_ThrowN: FtCommonBone = 52;
pub const FtCommonBone_Extra: FtCommonBone = 53;
pub type FtCommonBone = ::std::os::raw::c_uint;
pub const Ft_AttackKind_ATKKIND_0: Ft_AttackKind = 0;
pub const Ft_AttackKind_ATKKIND_NONE: Ft_AttackKind = 1;
pub const Ft_AttackKind_ATKKIND_JAB1: Ft_AttackKind = 2;
pub const Ft_AttackKind_ATKKIND_JAB2: Ft_AttackKind = 3;
pub const Ft_AttackKind_ATKKIND_JAB3: Ft_AttackKind = 4;
pub const Ft_AttackKind_ATKKIND_JAB4: Ft_AttackKind = 5;
pub const Ft_AttackKind_ATKKIND_DASH: Ft_AttackKind = 6;
pub const Ft_AttackKind_ATKKIND_FTILT: Ft_AttackKind = 7;
pub const Ft_AttackKind_ATKKIND_UTILT: Ft_AttackKind = 8;
pub const Ft_AttackKind_ATKKIND_DTILT: Ft_AttackKind = 9;
pub const Ft_AttackKind_ATKKIND_FSMASH: Ft_AttackKind = 10;
pub const Ft_AttackKind_ATKKIND_USMASH: Ft_AttackKind = 11;
pub const Ft_AttackKind_ATKKIND_DSMASH: Ft_AttackKind = 12;
pub const Ft_AttackKind_ATKKIND_NAIR: Ft_AttackKind = 13;
pub const Ft_AttackKind_ATKKIND_FAIR: Ft_AttackKind = 14;
pub const Ft_AttackKind_ATKKIND_BAIR: Ft_AttackKind = 15;
pub const Ft_AttackKind_ATKKIND_UAIR: Ft_AttackKind = 16;
pub const Ft_AttackKind_ATKKIND_DAIR: Ft_AttackKind = 17;
pub const Ft_AttackKind_ATKKIND_SPECIALN: Ft_AttackKind = 18;
pub const Ft_AttackKind_ATKKIND_SPECIALS: Ft_AttackKind = 19;
pub const Ft_AttackKind_ATKKIND_SPECIALHI: Ft_AttackKind = 20;
pub const Ft_AttackKind_ATKKIND_SPECIALLW: Ft_AttackKind = 21;
pub type Ft_AttackKind = ::std::os::raw::c_uint;
#[doc = " Structs"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Playerblock {
    pub state: ::std::os::raw::c_int,
    pub ft_kind: ::std::os::raw::c_int,
    pub type_: ::std::os::raw::c_int,
    pub isTransformed: [u8_; 2usize],
    pub tagPos: Vec3,
    pub spawnPos: Vec3,
    pub respawnPos: Vec3,
    pub x34: ::std::os::raw::c_int,
    pub x38: ::std::os::raw::c_int,
    pub x3C: ::std::os::raw::c_int,
    pub initialFacing: f32,
    pub costume: u8_,
    pub x45: u8_,
    pub tint: u8_,
    pub team: u8_,
    pub controller: u8_,
    pub cpuLv: u8_,
    pub cpuKind: u8_,
    pub handicap: u8_,
    pub x50: f32,
    pub attack: f32,
    pub defense: f32,
    pub scale: f32,
    pub damage: u16_,
    pub initialDamage: u16_,
    pub stamina: u16_,
    pub falls: [::std::os::raw::c_int; 2usize],
    pub ko: [::std::os::raw::c_int; 6usize],
    pub x88: ::std::os::raw::c_int,
    pub selfDestructs: u16_,
    pub stocks: u8_,
    pub coins_curr: ::std::os::raw::c_int,
    pub coins_total: ::std::os::raw::c_int,
    pub x98: ::std::os::raw::c_int,
    pub x9c: ::std::os::raw::c_int,
    pub stickSmashes: [::std::os::raw::c_int; 2usize],
    pub tag: ::std::os::raw::c_int,
    pub flags2: u8_,
    pub flags3: u8_,
    pub fighterData: *mut GOBJ,
    pub fighterDataSub: *mut GOBJ,
}
#[test]
fn bindgen_test_layout_Playerblock() {
    assert_eq!(
        ::std::mem::size_of::<Playerblock>(),
        192usize,
        concat!("Size of: ", stringify!(Playerblock))
    );
    assert_eq!(
        ::std::mem::align_of::<Playerblock>(),
        8usize,
        concat!("Alignment of ", stringify!(Playerblock))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).state as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).ft_kind as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(ft_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).type_ as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).isTransformed as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(isTransformed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).tagPos as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(tagPos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).spawnPos as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(spawnPos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).respawnPos as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(respawnPos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).x34 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(x34)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).x38 as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(x38)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).x3C as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(x3C)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).initialFacing as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(initialFacing)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).costume as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(costume)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).x45 as *const _ as usize },
        69usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(x45)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).tint as *const _ as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(tint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).team as *const _ as usize },
        71usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(team)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).controller as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(controller)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).cpuLv as *const _ as usize },
        73usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(cpuLv)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).cpuKind as *const _ as usize },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(cpuKind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).handicap as *const _ as usize },
        75usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(handicap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).x50 as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(x50)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).attack as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(attack)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).defense as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(defense)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).scale as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).damage as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(damage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).initialDamage as *const _ as usize },
        94usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(initialDamage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).stamina as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(stamina)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).falls as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(falls)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).ko as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(ko)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).x88 as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(x88)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).selfDestructs as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(selfDestructs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).stocks as *const _ as usize },
        138usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(stocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).coins_curr as *const _ as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(coins_curr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).coins_total as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(coins_total)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).x98 as *const _ as usize },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(x98)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).x9c as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(x9c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).stickSmashes as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(stickSmashes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).tag as *const _ as usize },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(tag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).flags2 as *const _ as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(flags2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).flags3 as *const _ as usize },
        169usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(flags3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).fighterData as *const _ as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(fighterData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<Playerblock>())).fighterDataSub as *const _ as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(Playerblock),
            "::",
            stringify!(fighterDataSub)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PlayerData {
    pub kind: u8_,
    pub status: u8_,
    pub stocks: u8_,
    pub costume: u8_,
    pub portNumberOverride: u8_,
    pub spawnPointOverride: u8_,
    pub facingDirection: u8_,
    pub subcolor: u8_,
    pub handicap: u8_,
    pub team: u8_,
    pub nametag: u8_,
    pub xb: u8_,
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize], u8>,
    pub cpuKind: u8_,
    pub cpuLevel: u8_,
    pub damageStart: u16_,
    pub damageSpawn: u16_,
    pub staminaStart: u16_,
    pub attack: f32,
    pub defense: f32,
    pub scale: f32,
}
#[test]
fn bindgen_test_layout_PlayerData() {
    assert_eq!(
        ::std::mem::size_of::<PlayerData>(),
        36usize,
        concat!("Size of: ", stringify!(PlayerData))
    );
    assert_eq!(
        ::std::mem::align_of::<PlayerData>(),
        4usize,
        concat!("Alignment of ", stringify!(PlayerData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).kind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).status as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).stocks as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(stocks)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).costume as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(costume)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).portNumberOverride as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(portNumberOverride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).spawnPointOverride as *const _ as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(spawnPointOverride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).facingDirection as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(facingDirection)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).subcolor as *const _ as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(subcolor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).handicap as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(handicap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).team as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(team)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).nametag as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(nametag)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).xb as *const _ as usize },
        11usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(xb)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).cpuKind as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(cpuKind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).cpuLevel as *const _ as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(cpuLevel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).damageStart as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(damageStart)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).damageSpawn as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(damageSpawn)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).staminaStart as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(staminaStart)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).attack as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(attack)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).defense as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(defense)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<PlayerData>())).scale as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(PlayerData),
            "::",
            stringify!(scale)
        )
    );
}
impl PlayerData {
    #[inline]
    pub fn isRumble(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_isRumble(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn isEntry(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_isEntry(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn unk2(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 6u8) as u8) }
    }
    #[inline]
    pub fn set_unk2(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 6u8, val as u64)
        }
    }
    #[inline]
    pub fn unk3(&self) -> ::std::os::raw::c_uchar {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u8) }
    }
    #[inline]
    pub fn set_unk3(&mut self, val: ::std::os::raw::c_uchar) {
        unsafe {
            let val: u8 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        isRumble: ::std::os::raw::c_uchar,
        isEntry: ::std::os::raw::c_uchar,
        unk2: ::std::os::raw::c_uchar,
        unk3: ::std::os::raw::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 2usize], u8> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize], u8> =
            Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let isRumble: u8 = unsafe { ::std::mem::transmute(isRumble) };
            isRumble as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let isEntry: u8 = unsafe { ::std::mem::transmute(isEntry) };
            isEntry as u64
        });
        __bindgen_bitfield_unit.set(2usize, 6u8, {
            let unk2: u8 = unsafe { ::std::mem::transmute(unk2) };
            unk2 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let unk3: u8 = unsafe { ::std::mem::transmute(unk3) };
            unk3 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FighterBone {
    pub joint: *mut JOBJ,
    pub joint2: *mut JOBJ,
    pub flags: ::std::os::raw::c_int,
    pub flags2: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_FighterBone() {
    assert_eq!(
        ::std::mem::size_of::<FighterBone>(),
        24usize,
        concat!("Size of: ", stringify!(FighterBone))
    );
    assert_eq!(
        ::std::mem::align_of::<FighterBone>(),
        8usize,
        concat!("Alignment of ", stringify!(FighterBone))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FighterBone>())).joint as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FighterBone),
            "::",
            stringify!(joint)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FighterBone>())).joint2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(FighterBone),
            "::",
            stringify!(joint2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FighterBone>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(FighterBone),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FighterBone>())).flags2 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(FighterBone),
            "::",
            stringify!(flags2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DynamicsDesc {
    pub root_bone: ::std::os::raw::c_int,
    pub params: *mut ::std::os::raw::c_void,
    pub num: ::std::os::raw::c_int,
    pub xc: f32,
    pub x10: f32,
    pub x14: f32,
}
#[test]
fn bindgen_test_layout_DynamicsDesc() {
    assert_eq!(
        ::std::mem::size_of::<DynamicsDesc>(),
        32usize,
        concat!("Size of: ", stringify!(DynamicsDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<DynamicsDesc>(),
        8usize,
        concat!("Alignment of ", stringify!(DynamicsDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DynamicsDesc>())).root_bone as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DynamicsDesc),
            "::",
            stringify!(root_bone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DynamicsDesc>())).params as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DynamicsDesc),
            "::",
            stringify!(params)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DynamicsDesc>())).num as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(DynamicsDesc),
            "::",
            stringify!(num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DynamicsDesc>())).xc as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(DynamicsDesc),
            "::",
            stringify!(xc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DynamicsDesc>())).x10 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(DynamicsDesc),
            "::",
            stringify!(x10)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DynamicsDesc>())).x14 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(DynamicsDesc),
            "::",
            stringify!(x14)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DynamicsHitDesc {
    pub bone: ::std::os::raw::c_int,
    pub x4: ::std::os::raw::c_int,
    pub x8: Vec3,
}
#[test]
fn bindgen_test_layout_DynamicsHitDesc() {
    assert_eq!(
        ::std::mem::size_of::<DynamicsHitDesc>(),
        20usize,
        concat!("Size of: ", stringify!(DynamicsHitDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<DynamicsHitDesc>(),
        4usize,
        concat!("Alignment of ", stringify!(DynamicsHitDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DynamicsHitDesc>())).bone as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DynamicsHitDesc),
            "::",
            stringify!(bone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DynamicsHitDesc>())).x4 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(DynamicsHitDesc),
            "::",
            stringify!(x4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DynamicsHitDesc>())).x8 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(DynamicsHitDesc),
            "::",
            stringify!(x8)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DynamicsBehave {
    pub num: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_DynamicsBehave() {
    assert_eq!(
        ::std::mem::size_of::<DynamicsBehave>(),
        4usize,
        concat!("Size of: ", stringify!(DynamicsBehave))
    );
    assert_eq!(
        ::std::mem::align_of::<DynamicsBehave>(),
        4usize,
        concat!("Alignment of ", stringify!(DynamicsBehave))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<DynamicsBehave>())).num as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(DynamicsBehave),
            "::",
            stringify!(num)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ftDynamics {
    pub dynamics_num: ::std::os::raw::c_int,
    pub dynamics_desc: *mut DynamicsDesc,
    pub dynamics_hit_num: ::std::os::raw::c_int,
    pub dynamics_hit_desc: *mut DynamicsHitDesc,
    pub dynamics_behave: *mut *mut DynamicsBehave,
}
#[test]
fn bindgen_test_layout_ftDynamics() {
    assert_eq!(
        ::std::mem::size_of::<ftDynamics>(),
        40usize,
        concat!("Size of: ", stringify!(ftDynamics))
    );
    assert_eq!(
        ::std::mem::align_of::<ftDynamics>(),
        8usize,
        concat!("Alignment of ", stringify!(ftDynamics))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftDynamics>())).dynamics_num as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ftDynamics),
            "::",
            stringify!(dynamics_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftDynamics>())).dynamics_desc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ftDynamics),
            "::",
            stringify!(dynamics_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftDynamics>())).dynamics_hit_num as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ftDynamics),
            "::",
            stringify!(dynamics_hit_num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftDynamics>())).dynamics_hit_desc as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ftDynamics),
            "::",
            stringify!(dynamics_hit_desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftDynamics>())).dynamics_behave as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ftDynamics),
            "::",
            stringify!(dynamics_behave)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ftData {
    pub footBoneL: ::std::os::raw::c_char,
    pub footBoneR: ::std::os::raw::c_char,
    pub charAttributes: *mut ::std::os::raw::c_int,
    pub modelLookup: *mut u8_,
    pub animFlags: ::std::os::raw::c_int,
    pub animDynamics: ::std::os::raw::c_int,
    pub x14: ::std::os::raw::c_int,
    pub x18: ::std::os::raw::c_int,
    pub x1C: ::std::os::raw::c_int,
    pub x20: ::std::os::raw::c_int,
    pub x24: ::std::os::raw::c_int,
    pub x28: ::std::os::raw::c_int,
    pub dynamics: *mut ftDynamics,
    pub hurtbox: ::std::os::raw::c_int,
    pub center_bubble: *mut ::std::os::raw::c_int,
    pub x38: ::std::os::raw::c_int,
    pub x3C: ::std::os::raw::c_int,
    pub x40: ::std::os::raw::c_int,
    pub coll: ::std::os::raw::c_int,
    pub items: *mut ::std::os::raw::c_void,
    pub x4C: *mut ::std::os::raw::c_int,
    pub x50: ::std::os::raw::c_int,
    pub x54: ::std::os::raw::c_int,
    pub boneLookup: *mut ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ftData() {
    assert_eq!(
        ::std::mem::size_of::<ftData>(),
        128usize,
        concat!("Size of: ", stringify!(ftData))
    );
    assert_eq!(
        ::std::mem::align_of::<ftData>(),
        8usize,
        concat!("Alignment of ", stringify!(ftData))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).footBoneL as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(footBoneL)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).footBoneR as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(footBoneR)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).charAttributes as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(charAttributes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).modelLookup as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(modelLookup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).animFlags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(animFlags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).animDynamics as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(animDynamics)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x14 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x14)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x18 as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x18)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x1C as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x1C)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x20 as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x20)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x24 as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x24)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x28 as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x28)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).dynamics as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(dynamics)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).hurtbox as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(hurtbox)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).center_bubble as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(center_bubble)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x38 as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x38)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x3C as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x3C)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x40 as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x40)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).coll as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(coll)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).items as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(items)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x4C as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x4C)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x50 as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x50)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).x54 as *const _ as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(x54)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftData>())).boneLookup as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(ftData),
            "::",
            stringify!(boneLookup)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ftChkDevice {
    pub x0: ::std::os::raw::c_int,
    pub x4: ::std::os::raw::c_int,
    pub x8: ::std::os::raw::c_int,
    pub xc: ::std::os::raw::c_int,
    pub x10: ::std::os::raw::c_int,
    pub x14: ::std::os::raw::c_int,
    pub x18: ::std::os::raw::c_int,
    pub x1c: ::std::os::raw::c_int,
    pub x20: ::std::os::raw::c_int,
    pub gobj: *mut GOBJ,
    pub hazard_kind: ::std::os::raw::c_int,
    pub check: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_ftChkDevice() {
    assert_eq!(
        ::std::mem::size_of::<ftChkDevice>(),
        64usize,
        concat!("Size of: ", stringify!(ftChkDevice))
    );
    assert_eq!(
        ::std::mem::align_of::<ftChkDevice>(),
        8usize,
        concat!("Alignment of ", stringify!(ftChkDevice))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).x0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(x0)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).x4 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(x4)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).x8 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(x8)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).xc as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(xc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).x10 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(x10)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).x14 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(x14)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).x18 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(x18)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).x1c as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(x1c)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).x20 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(x20)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).gobj as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(gobj)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).hazard_kind as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(hazard_kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ftChkDevice>())).check as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(ftChkDevice),
            "::",
            stringify!(check)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SubactionHeader {
    pub symbol: *mut ::std::os::raw::c_char,
    pub animOffset: ::std::os::raw::c_int,
    pub animSize: ::std::os::raw::c_int,
    pub subactionData: *mut ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_SubactionHeader() {
    assert_eq!(
        ::std::mem::size_of::<SubactionHeader>(),
        32usize,
        concat!("Size of: ", stringify!(SubactionHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<SubactionHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(SubactionHeader))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubactionHeader>())).symbol as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SubactionHeader),
            "::",
            stringify!(symbol)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubactionHeader>())).animOffset as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SubactionHeader),
            "::",
            stringify!(animOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubactionHeader>())).animSize as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SubactionHeader),
            "::",
            stringify!(animSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubactionHeader>())).subactionData as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SubactionHeader),
            "::",
            stringify!(subactionData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SubactionHeader>())).flags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SubactionHeader),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MoveLogic {
    pub animation_id: ::std::os::raw::c_int,
    pub flags: ::std::os::raw::c_int,
    pub move_id: ::std::os::raw::c_char,
    pub bitflags1: ::std::os::raw::c_char,
    pub animation_callback: *mut ::std::os::raw::c_void,
    pub iasa_callback: *mut ::std::os::raw::c_void,
    pub physics_callback: *mut ::std::os::raw::c_void,
    pub collision_callback: *mut ::std::os::raw::c_void,
    pub camera_callback: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_MoveLogic() {
    assert_eq!(
        ::std::mem::size_of::<MoveLogic>(),
        56usize,
        concat!("Size of: ", stringify!(MoveLogic))
    );
    assert_eq!(
        ::std::mem::align_of::<MoveLogic>(),
        8usize,
        concat!("Alignment of ", stringify!(MoveLogic))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MoveLogic>())).animation_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(MoveLogic),
            "::",
            stringify!(animation_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MoveLogic>())).flags as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(MoveLogic),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MoveLogic>())).move_id as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(MoveLogic),
            "::",
            stringify!(move_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MoveLogic>())).bitflags1 as *const _ as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(MoveLogic),
            "::",
            stringify!(bitflags1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MoveLogic>())).animation_callback as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(MoveLogic),
            "::",
            stringify!(animation_callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MoveLogic>())).iasa_callback as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(MoveLogic),
            "::",
            stringify!(iasa_callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MoveLogic>())).physics_callback as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(MoveLogic),
            "::",
            stringify!(physics_callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MoveLogic>())).collision_callback as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(MoveLogic),
            "::",
            stringify!(collision_callback)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<MoveLogic>())).camera_callback as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(MoveLogic),
            "::",
            stringify!(camera_callback)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ReflectDesc {
    pub bone: ::std::os::raw::c_int,
    pub max_damage: ::std::os::raw::c_int,
    pub pos: Vec3,
    pub radius: f32,
    pub damage_mult: f32,
    pub velocity_mult: f32,
    pub flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ReflectDesc() {
    assert_eq!(
        ::std::mem::size_of::<ReflectDesc>(),
        36usize,
        concat!("Size of: ", stringify!(ReflectDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<ReflectDesc>(),
        4usize,
        concat!("Alignment of ", stringify!(ReflectDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ReflectDesc>())).bone as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ReflectDesc),
            "::",
            stringify!(bone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ReflectDesc>())).max_damage as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ReflectDesc),
            "::",
            stringify!(max_damage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ReflectDesc>())).pos as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ReflectDesc),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ReflectDesc>())).radius as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ReflectDesc),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ReflectDesc>())).damage_mult as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ReflectDesc),
            "::",
            stringify!(damage_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ReflectDesc>())).velocity_mult as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ReflectDesc),
            "::",
            stringify!(velocity_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ReflectDesc>())).flags as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ReflectDesc),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ShieldDesc {
    pub bone: ::std::os::raw::c_int,
    pub max_damage: ::std::os::raw::c_int,
    pub pos: Vec3,
    pub radius: f32,
    pub damage_mult: f32,
    pub velocity_mult: f32,
    pub flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ShieldDesc() {
    assert_eq!(
        ::std::mem::size_of::<ShieldDesc>(),
        36usize,
        concat!("Size of: ", stringify!(ShieldDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<ShieldDesc>(),
        4usize,
        concat!("Alignment of ", stringify!(ShieldDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ShieldDesc>())).bone as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ShieldDesc),
            "::",
            stringify!(bone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ShieldDesc>())).max_damage as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ShieldDesc),
            "::",
            stringify!(max_damage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ShieldDesc>())).pos as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ShieldDesc),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ShieldDesc>())).radius as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ShieldDesc),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ShieldDesc>())).damage_mult as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ShieldDesc),
            "::",
            stringify!(damage_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ShieldDesc>())).velocity_mult as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ShieldDesc),
            "::",
            stringify!(velocity_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ShieldDesc>())).flags as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ShieldDesc),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AbsorbDesc {
    pub bone: ::std::os::raw::c_int,
    pub max_damage: ::std::os::raw::c_int,
    pub pos: Vec3,
    pub radius: f32,
    pub damage_mult: f32,
    pub velocity_mult: f32,
    pub flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_AbsorbDesc() {
    assert_eq!(
        ::std::mem::size_of::<AbsorbDesc>(),
        36usize,
        concat!("Size of: ", stringify!(AbsorbDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<AbsorbDesc>(),
        4usize,
        concat!("Alignment of ", stringify!(AbsorbDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AbsorbDesc>())).bone as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(AbsorbDesc),
            "::",
            stringify!(bone)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AbsorbDesc>())).max_damage as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(AbsorbDesc),
            "::",
            stringify!(max_damage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AbsorbDesc>())).pos as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(AbsorbDesc),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AbsorbDesc>())).radius as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(AbsorbDesc),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AbsorbDesc>())).damage_mult as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(AbsorbDesc),
            "::",
            stringify!(damage_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AbsorbDesc>())).velocity_mult as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(AbsorbDesc),
            "::",
            stringify!(velocity_mult)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<AbsorbDesc>())).flags as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(AbsorbDesc),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HitVictim {
    pub victim_data: *mut ::std::os::raw::c_void,
    pub unk: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_HitVictim() {
    assert_eq!(
        ::std::mem::size_of::<HitVictim>(),
        16usize,
        concat!("Size of: ", stringify!(HitVictim))
    );
    assert_eq!(
        ::std::mem::align_of::<HitVictim>(),
        8usize,
        concat!("Alignment of ", stringify!(HitVictim))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<HitVictim>())).victim_data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(HitVictim),
            "::",
            stringify!(victim_data)
